{
    "viz2.1":"self-learners",
    "viz2.2":"and animators, artists, game makers, creative-technologists, curriculum planners, designers, graphic designers, graphics editors, learning experience designers, project managers, software engineer, student, teachers, university faculty members, visualization researchers",
    "viz2.3":"w/ all kinds of experiences",
    "Directionsmap":"Click on the stars to learn more!",
    "Directions":"Click on the pink text to change graphs!",
    "Directions2":"Press space to interact with this visualization!",
    "Created By":"Created By",
   "2020Gallery_Intro":"To learn more about the project and how it was made, click on the image of each card preview. \n\nFeel free to leave feedback or a comment in our [guestbook](https://forms.gle/Mxb2thi2k27EZ3Mo7)!",
   "Project Links": "Project Links",
   "Visualizations":"Visualizations",
   "Projects":"Projects",
   "Social Media":"Social Media",
   "Tools":"Tools",
   "Live":"Live",
   "Code":"Code",
   "About1":"What is the p5.js Showcase?",
   "About2":"How is it organized?",
   "About3":"What else should I check out?",
   "Acknowledgements":"Acknowledgements",
   "Acknowledgements_Description": "I'd like to thank [GSoC](https://summerofcode.withgoogle.com/) and the [Processing Foundation](https://processingfoundation.org/) for allowing me to see this project through. I'd also like to thank my wonderful mentors Sam Vassor, KT Duffy, and Ashley Kang for all their (emotional and technical) support and words of wisdom. Finally I'd like to thank Lauren McCarthy, Saber Khan, Qianqian Ye, evelyn masso, Connie Liu, Jiwon Shin and the p5 maintainers and contributors for helping me with this project and being a part of the start of my open source journey 💗",
   "Answer1": "The p5.js Showcase is an online gallery of work created with [p5.js](https://p5js.org/), an open source creative computing library. It was created by [Ashley Kang](https://ashleykang.dev) in 2019 ([view the 2019 Showcase here](https://p5js.org/showcase/)), previously curated by [Connie Liu](https://connieliu0.github.io), and currently maintained by [Katie Chan](https://katiechan.cargo.site/). \n \n The purpose of the Showcase is to celebrate how people are using and learning p5.js to make creative work with the aim of conveying our core values of inclusivity.",
   "Answer2":"Usually the p5.js will open up a call for submissions via [Twitter](https://twitter.com/p5xjs) or [Instagram](https://www.instagram.com/p5xjs/)! For the past three years, the Showcase has been run as a [GSoC project](https://summerofcode.withgoogle.com/). In addition, this year's showcase was organized and curated based off of a specific theme." ,
   "Answer3":"Make some sketches of your own with the [p5.js editor](https://editor.p5js.org/), discover more with [OpenProcessing](https://www.openProcessing.org/), and learn more with the [Coding Train](https://www.youtube.com/user/shiffman), [sosunnyproject] (https://www.youtube.com/channel/UCKNXAqIvqc25JJ1CWdayqBA), and [Xinxin] (https://www.youtube.com/channel/UCufOCDs5G1A4AffwmeV0XBw)!",
   "Question1":"What are you up to? How did you get started with p5.js?",
   "Question2":"How did you use p5.js in this project?",
   "Question3":"What's your favorite p5.js feature?",
   "Question4":"Did you face any challenges working on this project? If so, how did you overcome them?",
   "Question5":"What's a cool thing we should check out?",
   "Archiveabout": "The p5.js Showcase was started by Ashley Kang in the summer of 2019 and has continued on each summer since. View or read more about each project below!",
   "2019about": "Curated by [Ashley Kang](https://ashleykang.dev/) in the summer of 2019, below is the first ever curated collection of the p5.js Showcase! Learn more about each one by clicking on the preview. \n \n[View the original implementation here!](https://p5js.org/showcase/)",
   "About":"About the p5.js Showcase",
   "Welcome":"Welcome to the p5.js 2022 Showcase",
   "2020_intro1":"During Summer 2022 we asked the p5.js community around the world to submit their work for a showcase that was centered around love, specifically author [bell hooks' love ethic] (https://cac.org/a-love-ethic-2020-11-11/). To embrace the love ethic is to utilize all dimensions of love - 'care, commitment, trust, responsibility, respect, and knowledge' - in our everyday lives.",
   "2020_intro1.5":"Here, you'll find a diverse array of work that interpret the love ethic through p5.js, demonstrating how p5.js can be a radical community with values rooted in social justice and accessibility. As the curator of this year's showcase, I am enamoured by the p5.js community and their passion for pushing the perceptions of how p5.js can be used.",
   "2020_intro2":"Learn more about the p5.js community below!",
   "Viz1":"this year we got submissions from...",
   "Viz2":"our submitters are...",
   "Viz3":"to them p5.js is...",
   "Viz4":"view the projects →",
   "Jump to":"Jump to:",
   "filter by":"filter by",
   "filters":[
      {"name": "All"},
      {"name": "Visual"},
      {"name": "Data Visualization"},
      {"name": "Game"},
      {"name": "Text"},
      {"name": "Sound"},
      {"name": "Educational"},
      {"name": "Camera"}
   ],
  
    "difficulty":[
      {"name": "Beginner"},
      {"name": "Intermediate"},
      {"name": "Advanced"}
    ],
  
    "archive":[
      {
        "id":"2020-showcase",
        "title": "p5.js 2020 Showcase",
        "image":"qtv.png",
        "description": "Curated by Connie Liu"
      },
      {
        "id":"2019-showcase",
        "title": "p5.js 2019 Showcase",
        "image":"airi-flies.png",
        "description": "Curated by Ashley Kang"
      }
    ],
  
  "showcase2020":[
        {
          "author": "Sydney DJ",
          "pronouns": "she/her",
          "location": "New York, NY",
          "title": "Black Lives Matter Chatbot",
          "description": "My project is a Chatbot that reviews basic terminology and information regarding the Black Lives Matter Movement, police brutality, and the difference between race, ethnicity, and nationality. There are also Google forms included in the Chatbot, one being a recap on the information recieved during the conversation, and another as a feedback form on the experience.",
          "extradesc": "", 
          "live": "https://sydneychatbot.glitch.me/",
          "code": "https://glitch.com/edit/#!/sydneychatbot?path=brain.rive%3A1%3A0",
          "type": "Educational",
          "tools": "",
          "difficulty": "Intermediate",
          "answer1": "I'm a senior in high school, with a great interest or more so dedication to social justice and leadership. I am currently in the process of doing college research, and am finishing up a summer internship with JPMorganChase. I also have my own podcast called \"sorry in advance :/\".",
          "answer2": "I started through my Programming and Robotics class with Mr. Nauman. This was my frist p5.js project. I had little to no experience prior, but was interested in the class as my previous Robotics elective/team was put on pause due to Covid-19.",
          "answer3": "I used p5.js for the entirety of this project through Glitch, for sizing, design, etc.",
          "answer4": "I do not have a favorite feature in particular as this was more so inserting my interest/work into a class assignment.",
          "answer5": "Ensuring that conversation remained somewhat smoothly, while also allowing for younger students to be able to use the chatbot as well, was definitely a challenge.",
          "answer6": "I would truly appreciate people checking out the Google forms inc luded as I can see the responses and learn where I can improve as well as how muich information people have on these topics already.",
          "social": "https://sydneynicole1.wixsite.com/website",
          "id":"BLM-Chatbot",
          "picid": "62.png"
  
        },
  
        {
          "author": "Niki Ito",
          "pronouns": "she/her",
          "location": "NY, USA.",
          "title": "Artist Activists Interactive Portrait",
          "description": "This interactive portrait showcases artist activists within the Asian American community. The portrait captures them in a humble setting where you can explore their work and learn about their contribution through interacting with the 2D elements.",
          "extradesc": "",
          "live": "https://niki-ito.github.io/Artist-Activists-Interactive-Portrait/",
          "code": "https://github.com/niki-ito/Artist-Activists-Interactive-Portrait",
          "type": "Educational",
          "tools": "p5.sound, p5.Element, select(), createButton(), noCursor(), preload(), push(), class, console, mouseX, mouseY, map(), millis()",
          "difficulty": "Intermediate",
          "answer1": "I'm a graphic design undergraduate student. I enjoy working with fine art, graphic design, and multi-media art. This summer, I was a part of Google Summer of Code to create a community-focused visual narrative website with audio visualizations created in p5.",
          "answer2": "I first learned p5.js early this year. It was in my Programming for Artists class with professor Stalgia Grigg. My first project was to create a still-life by only using p5.js. I later used map(), mouseX, and mouseY to make the still-life interactive with a parallax effect.",
          "answer3": "I used p5.js in this project to make the visual elements interactable. The illustrated elements within the portrait were first drawn by hand, photographed, edited in Adobe Photoshop, and later uploaded into the p5 editor. The illustration was separated into layers which allowed me to create a parallax effect using map(), mouseX, and mouseY. I also used millis() and if statements to compose an animated gif within the editor. \n\nOnce I finished the basic portrait, I added HTML and CSS elements to show descriptions. I used p5.Element, select(), and other Event listeners to have the HTML elements change based on interactions with the p5.js portrait. \n\nAfter creating the sketch within the p5 editor, I transported the files to a local development environment for better compatibility across various browsers.",
          "answer4": "My favorite function is mouseX and mouseY. I love seeing live interaction with digitally created elements. As an artist and designer, many of my creations were either still or animated but never interactive. The possibilities from these simple codes are endless and exciting.",
          "answer5": "I faced many challenges during this project. The only reason I was able to finish it in 3 weeks is because of my professor who knew all the answers to my questions. I was originally planning to create four different portraits which later changed to two, and ultimately one. The coding portion took the most time since I never get anything right with code on my first try. It took many attempts before having the code work smoothly. I have learned that with coding, it takes a lot of patients and optimism that if you continue to work on it, you will get it right.",
          "answer6": "I personally love stop motion and I get many inspirations form wanting to combine 2d elements with 3d textures and effects. Here is a stop motion director and artist I like: https://www.instagram.com/siqi.song/",
          "social": "https://www.instagram.com/12niki14/",
          "id":"Artists-Activists-Interactive-Portrait",
          "picid": "63.png",
          "twittericon": "twitter.png"
        },
  
        {
          "author": "Winnie Soon",
          "pronouns": "they/them",
          "location": "Denmark",
          "title": "Vocable Code",
          "description": "A “codework” (where the source code and critical writing operate together) produced to embody “queer code”, examining the notion of queerness in computer coding through the interplay of different human and nonhuman voices.",
          "extradesc": "Collective statements and voices complete the phrase “Queer is…” and together make a computational and poetic composition. Through running Vocable Code on a browser, the texts and voices are repeated and disrupted by mathematical chaos, creating a dynamic audio-visual literature and exploring the performativity of code, subjectivity and language.",
          "live": "https://dobbeltdagger.net/VocableCode_Educational/",
          "code": "https://github.com/siusoon/VocableCode/blob/master/vocablecode_program/vocableCode.js",
          "type": "Text",
          "tools": "p5.sound, random(),",
          "difficulty": "Intermediate",
          "answer1": "I am an artist and teacher working on queer code. I have been teaching p5 for few years and just published a book called aesthetic programming with Geoff Cox: https://aesthetic-programming.net/",
          "answer2": "I started with processing first and then switched to p5.js couple years ago.",
          "answer3": "Instead of just focusing on the technical syntax, I also pay attention to the language of the syntax and how they sound when one reads aloud. I use the sound library to load the sound clips and play them, but the loadjson() is an important function too to store the meta data of each voice contributor.",
          "answer4": "draw() - it is conceptually powerful to think about programming as drawing, but with the continuous loop feature. It changes the way on how your structure elements.",
          "answer5": "The challenges are writing the code that is readable, speakable and executable.",
          "answer6": "Read aloud the source code to think about the poetics of language (natural and machine languages)",
          "social": "https://siusoon.net/, https://twitter.com/siusoon?lang=en",
          "id":"Vocable-Code",
          "picid": "61.png"
        },
  
        {
          "author": "Neta Bomani",
          "pronouns": "any pronouns",
          "location": "Brooklyn, NY",
          "title": "Say Their Names",
          "description": "Every 5 seconds, Say Their Names displays the name of every Black person who was killed by police since 2015 according to the Washington Post.",
          "extradesc": "",
          "live": "https://saytheirnames.glitch.me",
          "code": "https://github.com/netanoir/say-their-names",
          "type": "Text",
          "tools": "loadTable()",
          "difficulty": "Intermediate",
          "answer1": "I'm an organizer and teacher at the School for Poetic Computation. I'm currently making zines about archives, abolition and technology and will be a first time vendor at the 2022 Brooklyn Art Book Fair.",
          "answer2": "I learned p5.js at SFPC and NYU ITP.",
          "answer3": "I used p5 to post process a live database by the Washington Post which includes every Black person killed by police violence since 2015.",
          "answer4": "createElement(), I love using p5 to generate HTML compositions, especially text compositions with <span>.",
          "answer5": "Yes, figuring out how to load a table and navigate through the table. Wasn't easy, but there are a few tutorials out there that helped me.",
          "answer6": "Survived & Punished's latest zine: No Good DAs https://www.survivedandpunishedny.org/anti-prosecution/no-good-das-zine/",
          "social": "https://netabomani.com",
          "id":"Say-Their-Names.",
          "picid": "64.png"
        },
  
  
        {
          "author": "Mona Lisa Thakur",
          "pronouns": "she/her",
          "location": "Gujarat, India",
          "title": "Self Love",
          "description": "A puzzle poem , inspired by the works of Dr Seuss,reminding us to  love ourselves",
          "extradesc": "Aristotle said that Self Love is derived from one's love of the good. Self-love can be a critical movement in supporting social justices. It can help in looking at yourself with love and kindness, and hence others too. Embracing one's identity  encourages encountering stereotypes and social biases.\n\nThe piece is a two-piece puzzle to 'charge' you and reminding you to love yourself a little more. Bring your hands together to see the message.",
          "live": "https://preview.p5js.org/monalisa.thakur282/present/CIJIJOtKw",
          "code": "https://editor.p5js.org/monalisa.thakur282/sketches/CIJIJOtKw",
          "type": "Camera",
          "tools": "ml5.js , P5.play",
          "difficulty": "Beginner",
          "answer1": "I am New Media Design student, currently working on my Graduation project. My work spans across transdisciplinary domains and involves experimenting with tech and its 'humane' interaction.",
          "answer2": "I first learned about creative coding from a friend. I started experimenting with processing and building audio visualizations. Nowadays, I am experimenting with PoseNet in p5",
          "answer3": "The whole project was made in p5.js. The web editor helped in making quick changes and sharing it with friends for feedback.I have used two community libraries, ml5 for PoseNet and p5.Play",
          "answer4": "I am currently exploring ml5. I like that it supports community libraries, which can be used in p5 very easily. The whole setup and environment takes away the pressure of being a novice. Folks and organization involved with teaching P5 are very enthusiastic and friendly.This could be used as a gentle and interesting introduction to programming.",
          "answer5": "Just keep Swimming'\n\nDo not give up easily. Breaking down the projects into smaller parts helps. Refer to the documentation. Many wonderful people have created very cool libraries which could be of help. And most importantly, explore and have fun doing it.\nOh, and watch out for missing ; or mistakes in spelling and case or   :p",
          "answer6": "I recently came across this video of Theatre Hours- https://vimeo.com/345012746\nThe project was shortlisted at Cannes Lions 2019 for branding. Interesting work on alphabets and Typography. Gave me some inspiration for a Typography based project in P5.",
          "social": "https://www.monalisathakur.com/",
          "id":"Self-Love",
          "picid": "65.png"
        },
  
        {
          "author": "Jay Borgwardt",
          "pronouns": "he/him",
          "location": "Los Angeles, California",
          "title": "The ASL Machine",
          "description": "A machine learning program that recognizes the letters of the American Sign Language alphabet to help people get started learning ASL!",
          "extradesc": "",
          "live": "https://asl-site-2.glitch.me/",
          "code": "https://asl-site-2.glitch.me/",
          "type": ["Camera", "Educational", "Tool"],
          "tools": "ml5.js",
          "difficulty": "Advanced",
          "answer1": "I'm a Media Arts + Practice student at USC focusing on interactive new media. This summer I'm interning at MB Labs (Qianqian Ye is sometimes there!)",
          "answer2": "I was introduced to p5.js in my Media Arts + Practice class IML 300 taught by Qianqian Ye. My first project was a basic drawing tool!",
          "answer3": "I used p5.js as a framework to implement and arrange two ml5.js algorithms: Handpose and ml5.neuralnetwork. I found Daniel Shiffman's ml5.js tutorials to be incredibly helpful and inspiring for the this project!",
          "answer4": "My favorite feature is createGraphics(), it's so nice to have a second canvas that you can move around, hide, or orient however you like!",
          "answer5": "I had a lot of trouble using machine learning models on glitch, as I had to use the glitch console to upload the model data.",
          "answer6": "I recently discovered https://neal.fun/ and it's been pretty inspiration for me in terms of design and interactivity!",
          "social": "https://www.instagram.com/jay.borgwardt/ , https://www.jayborgwardt.com/",
          "id":"The-ASL-Machine",
          "picid": "67.gif"
        },
  
        {
          "author": "patternseeing",
          "pronouns": "he/him",
          "location": "Frankfurt am Main, Germany",
          "title": "Constellations of Love",
          "description": "Generative art rendering unique constellation compositions using the letters of the word love over 100 different languages",
          "extradesc": "",
          "live": "https://constellationsoflove.netlify.app/",
          "code": "https://github.com/patternseeing/constellations-of-love",
          "type": "Text",
          "tools": "loadTable(),sin(),lerp()",
          "difficulty": "Intermediate",
          "answer1": "Art and design research practitioner with exploratory interests in human experience and cognition.",
          "answer2": "Having a previous experience using processing made p5js easier. learning mostly by going through P5js reference page when required to solve a part or the whole problem. Found coding train also as a wonderful resource. My first P5js sketches were a collection of interactive wallpapers.",
          "answer3": "I used p5js for the basic data parsing and also for defining the form and aesthetics of  the animation",
          "answer4": "My favorite function is lerp() and lerpColor() as it allow enormous possibilities in creating transformations and animations.",
          "answer5": "The first challenge was to create dictionary function that include all the characters of the word love in different languages. and the second was to finding the balance while working different layers of animations. As always Iterative process is often the only way out for me. I learn something new with every iteration.",
          "answer6": "https://www.youtube.com/watch?v=p8yfhE8F8MI",
          "social": "https://patternseeing.wordpress.com/",
          "id":"Constellations-of-Love",
          "picid": "constellations.jpg"
        },
        
  
        {
          "author": "Hala Shaban",
          "pronouns": "she/her",
          "location": "New York, New York",
          "title": "Guilty until Proven Innocent",
          "description": "According to Bureau of Justice Statistics, 480,000 Americans hold 64% of the total jail population amounting to $17 billion yearly cost of pre-trial detentions. These are people who have been charged with a crime but not convicted, meaning they are innocent in the eyes of the law. These numbers include minor arrests such as traffic violation and weed possession.",
          "extradesc": "",
          "live": "https://editor.p5js.org/HalaS/present/sbJtrb8Og",
          "code": "https://editor.p5js.org/HalaS/sketches/sbJtrb8Og",
          "type": "Data Visualization",
          "tools": "",
          "difficulty": "Intermediate",
          "answer1": "I'm a Digital Designer senior based in NYC and earlier this year I learned how to code HTML and Javascript. I'm currently applying for internships as I enjoy my last semester as an undergraduate.",
          "answer2": "Since March I've been learning P5 through my professor and mentor Stalgia. My work has been consisting of bringing attention to real world issues by combining art and coding.",
          "answer3": "I drew the background and coded the jail bars. My biggest struggle was portraying time passing, I was sure to add environment for it would take away from the message until I accidentally made the bars move. At first it was a still image and I added speed  {size *= 1;\n speedX *= '.01'}",
          "answer4": "My favorite feature that's not very noticeable is the texture of the bars. By adding strokeWeight and adding dividers, it gives and illusion effect and showing time passing.",
          "answer5": "My challenge that I solved recently is my drawing resolution wasn't big enough for the window. Meaning my drawing and canvas as on the left side of the window with the rest of the page is white and empty. I finally taught myself to go in the CSS file to {justify-content: center;} to shift everything to the center of the window, then I made the CSS background color black to match the canvas color in the JS file.",
          "answer6": "Cool things to check out and learn is basic CSS, CSS can edit and fix window problems that might be easier to solve then through JS",
          "social": "https://www.instagram.com/marsinwonder/",
          "id":"Guilty-Until-Proven-Innocent",
          "picid": "68.png"
        },
  
        {
          "author": "Jerson La Torre",
          "pronouns": "he/him",
          "location": "Lima, Perú",
          "title": "Black Stars",
          "description": "Duality is one of the most empathic concepts we can experience. Understanding that we only exist from the other and that differences are only illusions will help us to find true beauty in any instant of what we understand as time.",
          "extradesc": "",
          "live": "https://blackstars.surge.sh",
          "code": "https://github.com/jersonlatorre/blackstars",
          "type": "Visual",
          "tools": "p5.j, howler.js",
          "difficulty": "Intermediate",
          "answer1": "I am an artist, creative coder and teacher. I love to express myself in the language of movement and interaction.",
          "answer2": "I found p5js while looking for ways to use Processing from a web site. My first project was a set of tools to teach video game programming.",
          "answer3": "Basically the whole project is made in p5js. I use it to create the animations and interactions.",
          "answer4": "My favorites are learp() and map(). I also love that because it is based on javascript, it can be integrated with several other existing web libraries.",
          "answer5": "The most challenging thing was to manage the animations by states and control them using only one time variable. Often my biggest challenge is to simplify my own code.",
          "answer6": "The smoothness of the animations! It was what I had the hardest time achieving.",
          "social": "https://www.instagram.com/jerson.latorre",
          "id":"Black-Stars",
          "picid": "blackstars.png"
        },
  
        {
          "author": "Siori Kitajima",
          "pronouns": "she/her",
          "location": "California, USA",
          "title": "Perspective",
          "description": "A data viz animation which visualizes how many of us suffering from mental health issues in Singapore",
          "extradesc": "This generative sprite-animated data-biz piece was made for a Singapore documentary series 'Strangers In My Head' and their resource site. In some countries like Singapore and Japan, the mental health issue is still taboo, and people who suffer are often isolated. I wanted to visualize how it looks if we see how many of us are fighting for, to show that \"We are not alone.\" It is based on the real-world stats in Singapore (2016). I used p5.js and p5.play.js for the animation.",
          "live": "https://siorikitajima.github.io/perspective/",
          "code": "https://github.com/siorikitajima/perspective",
          "type": "Data Visualization",
          "tools": "p5.play.createSprite(), p5.play.frameDelay(), p5.play.setCollider()",
          "difficulty": "Intermediate",
          "answer1": "I'm a multimedia artist who loves data viz and generative art. Currently working on a series of data-viz about human's violence history and its correlation to information",
          "answer2": "When I started to learn javascript two years ago, I met Daniel Shiffman's amazing Code Train video tutorials. I learned javascript with P5, so P5 is like a home to me.",
          "answer3": "I used p5.play.js for sprite animation of each character, and p5.js for everything else, such as animating characters horizontally, their speed, color, timing, size, and vertical positioning (to mimic 3D space. This is not webgl)",
          "answer4": "noise()",
          "answer5": "This was my first time to use sprite animation with javascript. I created a demo with gif animation and p5 first, then started to try with different libraries like lottie.js and anime.js for sprite animation. I wanted to make characters walk at different speeds, and I want the sprite animation speed to match the walking speed. But controlling the speed of sprite animation was not very easy. After some tries and errors, I found p5.play, and its frameDelay() solved the problem.",
          "answer6": "https://earth.nullschool.net/",
          "social": "https://siorikitajima.com/",
          "id":"Perspective",
          "picid": "69.gif"
        },
  
        {
          "author": "Shervin Shirmohamadi",
          "pronouns": "he/him",
          "location": "Tehran,Iran.",
          "title": "Illogical Act",
          "description": "Regardless to your origin, color or society, Love happens due to your acts not to your thoughts .",
          "extradesc": "",
          "live": "https://preview.p5js.org/SherVin/present/6dsElgnDE",
          "code": "https://preview.p5js.org/SherVin/present/6dsElgnDE",
          "type": "Visual",
          "tools": "",
          "difficulty": "Beginner",
          "answer1": "I am a freshman majoring in mechanical engineering at Sbu,Teharn. I'm really fascinated by coding and programming to make systems become more smarter and precise and I'm new to  P5.",
          "answer2": "About 2 weeks ago, I became familiar with P5.js due to Behnaz Farahi works and advice on coding.My first projects were some simple geometrical shapes moving around and using simple methods .",
          "answer3": "As I said , I'm new to p5 and because of time shortage , I preferred to make this simple project as quick as possible and without any specific complexity like math functions or OOP \n and etc . \nAfter bringing shapes and required data in project , I used for-loops and if conditions to give more attraction to the project .",
          "answer4": "It's an difficult question to answer . Almost every method and function is useful but I think 'rectMode () or angleMode() ' is my favorite.",
          "answer5": "I was late knowing about this submission :( and I tried to make this project in the shortest time to be able to submit in the 2022 ShowCase . So there were some minor problems with Nested loops and the order of given properties.",
          "answer6": "More challenges or showCases for interested people .",
          "social": "",
          "id":"Illogical-Act",
          "picid": "illogical.png"
        },
      
        {
          "author": "Lillian",
          "pronouns": "she/her",
          "location": "London, UK",
          "title": "Cyber Forest",
          "description": "Cyber Forest is an Archival web game project talking about surveillance. Compared to visible violence, sometimes soft violence is more difficult to resist.",
          "extradesc": "It’s a time-based project which will record a small part of the time during the player’s life without any human intention. As this is the world Everything in this world is being recorded.",
          "live": "https://www.lillianlimd.com/cyber-forest",
          "code": "https://editor.p5js.org/lillianlimdi/sketches/--FNf4BAB",
          "type": "Game",
          "tools": "",
          "difficulty": "Beginner",
          "answer1": "I'm a computational arts student, this is my WIP show attempt before the final exhibition",
          "answer2": "I first started to learn processing, and then transform ideas to p5.js.\nAnd I got lots of inspiration from The Coding Train!",
          "answer3": "I got the basic ideas from (P5JS -- Daniel) https://thecodingtrain.com/CodingChallenges/147-chrome-dinosaur\nand (P5JS -- Web Full Game) https://editor.p5js.org/Ivan-Denisovich-py/sketches/HheYX4_2P\nThe rest of time is replacing the elements with my drawing and matching the theme I want.",
          "answer4": "frameCount function I guess? Have good fun playing with time :)",
          "answer5": "This is my first attempt to play with p5.js, compared with other basic and partial project, this kind of full piece could make me feel more achievable.",
          "answer6": "Love this tutorial!!\nhttps://thecodingtrain.com/CodingChallenges/147-chrome-dinosaur",
          "social": "https://www.lillianlimd.com/",
          "id":"Cyber-Forest",
          "picid": "70.gif"
        },
  
        {
          "author": "rare todd",
          "pronouns": "he/him",
          "location": "Brooklyn, NYC, USA",
          "title": "say their names...",
          "description": "The algorithms that structure and model our world are designed for maximizing efficiency. However, victims of vigilante-police violence often have names that aren’t legible to these systems and their names aren’t heard.",
          "extradesc": "The algorithms that structure and model our world are designed for maximizing efficiency. However, every system that seeks optimization necessarily leaves out those that are “unfit” and “not optimized”. \n\nWith “say their names…” I use genetic algorithms and natural selection as models to highlight victims of vigilante-police violence who are left out of our perspectives and narratives, even after their untimely deaths. The goal of this project is to use systems built for optimization to highlight the “unfit” that are left behind. For every victim of vigilante-police violence, there are many behind them whose names aren’t legible and are never spoken.",
          "live": "https://editor.p5js.org/raretodd/sketches/KGRkzdS1f",
          "code": "https://editor.p5js.org/raretodd/sketches/KGRkzdS1f",
          "type": ["Data Visualization", "Text"],
          "tools": "p5.speech",
          "difficulty": "Intermediate",
          "answer1": "I'm a graduate student at NYU's ITP. I'm also a communications technologies researcher at Citizen Lab, focusing my work on police surveillance practices of marginalized communities.",
          "answer2": "I was first introduced to P5 during ITP's Intro to Computational Media course.",
          "answer3": "The P5 environment is a perfect match for the p5 Speech library.",
          "answer4": "My favorite p5 feature is its accessibility. I love that I can log-in on any computer and my progress for any project is saved. Similarly, an important part of learning to code is revisiting my older work. I love that my previous p5 projects are saved and that I can easily access them when I need a refresher on syntax, functions, etc.",
          "answer5": "I'm borrowing a lot from Dan Shiffman's work on genetic algorithms. Admittedly, he's done all the hard work and I've just tweaked things to give them a fresh spin.",
          "answer6": "https://aprja.net/article/view/116062/164244",
          "social": "https://www.notion.so/raretodd/ITP-Shenanigans-53f7433348b641428d41d74b1089ab6d",
          "id":"say-their-names...",
          "picid": "saytheirnames2.png"
        },
  
  
        {
          "author": "Salil",
          "pronouns": "he/him",
          "location": "New York, USA",
          "title": "The Context Clock",
          "description": "Time is an integral part of our existence, and it defines our temporality. What happens when we change the unit of time?",
          "extradesc": "",
          "live": "https://editor.p5js.org/burnedsap/sketches/QJr6EWuaD",
          "code": "https://editor.p5js.org/burnedsap/sketches/QJr6EWuaD",
          "type": "Data Visualization",
          "tools": "",
          "difficulty": "Beginner",
          "answer1": "I'm a student at The New School, New York.",
          "answer2": "The Coding Train",
          "answer3": "I used p5js to create the clock, and the visuals",
          "answer4": "ellipse(); it's the simplest and can do so so much.",
          "answer5": "The challenge in this project was curating the different models of time, there's so many relevant ones to choose from.",
          "answer6": "https://www.alicemaz.com/writing/minecraft.html",
          "social": "http://salilparekh.work",
          "id":"The-Context-Clock",
          "picid": "66.png"
        },
  
        {
          "author": "Amira Hanafi",
          "pronouns": "she/her",
          "location": "Chicago, US",
          "title": "Mexicans in Canada",
          "description": "This digital poem plays with a sentence spoken by Gabriel Iglesias on the documentary series Inside Jokes — “And the next thing you know, there’s Mexicans in Canada.”  Nations and their demonymic forms are collected from Wikipedia.",
          "extradesc": "Can text in digital space take us everywhere on the human map? This digital poem re-assembles a sentence spoken by Gabriel Iglesias on the documentary series Inside Jokes (2018) — 'And the next thing you know, there’s Mexicans in Canada.' The poem moves its reader across the world, through countries and territories, among its citizens, crossing borders. Nations and their demonymic forms are collected from Wikipedia. The script is written in p5.js.",
          "live": "http://amiraha.com/mexicansincanada/",
          "code": "https://editor.p5js.org/ahaha333/sketches/uhUQJ6py5",
          "type": "Text",
          "tools": "",
          "difficulty": "Beginner",
          "answer1": "I'm a poet, cultural worker, and artist working with language as material.",
          "answer2": "I've been learning to work with p5.js since I worked with programmer Youssef Faltas to complete my project, 'A dictionary of the revolution.'",
          "answer3": "Once I learned how easy it was to use, different ideas came to me for how it could help me write experimental poetry. This is one of those ideas!",
          "answer4": "I love how intuitive and easy to remember the names of functions are.",
          "answer5": "It was pretty straightforward, to be honest!",
          "answer6": "https://www.youtube.com/watch?v=2m8YACFJlMg",
          "social": "https://amirahanafi.com",
          "id":"Mexicans-in-Canada",
          "picid": "canada.jpeg"
        },
      
        {
          "author": "Games For Crows",
          "pronouns": "they/them",
          "location": "London, England & Glasgow, Scotland & Belfast, Northern Ireland",
          "title": "Concrete Nest",
          "description": "A concrete poetry tool for gathering and arranging thoughts.",
          "extradesc": "",
          "live": "https://gamesforcrows.itch.io/concrete-nest",
          "code": "https://github.com/vividfax/concrete-nest",
          "type": ["Visual", "Game"],
          "tools": "loadStrings(), newAudio()",
          "difficulty": "Beginner",
          "answer1": "We're an indie game studio, creating games and other interactive things.",
          "answer2": "Started out with Processing, recommended by a friend.",
          "answer3": "The project is built in p5.js, using the reference library.",
          "answer4": "My favourite function is random(), and I like that it accepts arrays of choices.",
          "answer5": "We had an issue in selecting words, where they would stack on top of each other and be impossible to separate. We fixed this by putting the selected words in an array and offsetting them.",
          "answer6": "Tone.js. We've used it in another game to create generative music that the player builds by pressing keys",
          "social": "https://gamesforcrows.itch.io/",
          "id":"Games-For-Crows",
          "picid": "concretenest.png"
        },
        {
          "author": "Galo Canizares",
          "pronouns": "he/him",
          "location": "Texas, USA",
          "title": "Our Paper Space",
          "description": "Ourpaper.space is a work-in-progress online platform that allows individuals to come together anonymously and digitally draw on a single web browser canvas. In contrast to productivity software that relies on licensing, profitability, and other economic incentives, this online platform is available freely on the web and prioritizes an experience of abstract togetherness.",
          "extradesc": "Ourpaper.space is neither a game (as it has no objectives), nor is it a utility (as it has very few useful features). Instead, it is imagined as social infrastructure for experiencing visual delight on desktop and mobile devices. It suggests a way of navigating the realm of software toward less productive and more socially intimate ends.",
          "live": "http://www.ourpaper.space/",
          "code": "https://github.com/itsgalo/paperspace",
          "type": ["Visual", "Game"],
          "tools": "mouseX, mouseY",
          "difficulty": "Intermediate",
          "answer1": "I'm a designer, writer, and educator researching the softwarization of design and the architectural imagination. Currently a visiting assistant professor at the Texas Tech University College of Architecture.",
          "answer2": "In high school, I used to code in ActionScript for Flash, and spent a few years as a web designer. After graduate schools I picked up Processing and then discovered p5js around 2017.",
          "answer3": "This was built out of one of Daniel Shiffman's coding challenges. I took it further and thought about what a collaborative p5js sketch could do.",
          "answer4": "Mouse events are my most used features. I make a lot of drawing tools.",
          "answer5": "Integrating socket.io was a bit of a challenge, but again, Shiffman covers it really well.",
          "answer6": "Digital Fabrications: Designer Stories for a Software-Based Planet is a book I wrote recently about the intersections of software and design practice/education.",
          "social": "https://galocanizares.com/\n@itsgalo (Instagram)",
          "id":"Our-Paper-Space",
          "picid": "ourpaper.png"
        },
      
        {
          "author": "Filipe Lopes",
          "pronouns": "he/him",
          "location": "Porto, Portugal",
          "title": "POLISphone",
          "description": "POLISphone is a software for music performance, in- spired on the popular idea of “soundmap”. Unlike most soundmaps, its main aim is to provide a way to easily create original soundmaps and perform with it.",
          "extradesc": "",
          "live": "https://filipelopes.net/polisphone/",
          "code": "https://github.com/Filk/POLISphone",
          "type": "Sound",
          "tools": "P5.sound library",
          "difficulty": "Intermediate",
          "answer1": "I'm a composer and professor teaching in a higher education institute (ESMAD at Porto Polytechnic). I teach sound, audio and music to students interested in cinema, multimedia, music and music education. I also compose music for performances, cinema, installations and instrumental music",
          "answer2": "I was already a Processing enthusiast because I had already used it during my Masters and, afterwards, to develop the first version of POLISphone. Since many friends, students and music teachers were asking me to develop a version for the web (making it more accessible to schools anywhere), I started to learn P5.js.",
          "answer3": "My first aim was to implement in P5.js a similar version of POLISphone coded using Processing. My second aim (it still is an ongoing aim...) is to include the web possibilities (e.g. search sounds online, send my POLISphones to other persons, online data) to enhance its \"interactive\" possibilities.",
          "answer4": "P5.sound library and the P5.js website documentation/Examples",
          "answer5": "Yes. Implementing many features and make them work in all browsers and operative systems is hard! Dealing with sound in browsers is difficult. My way to address these issues was to search solutions online whenever a problem was occurring; test as many times as possible in different browsers and operative systems; ask help to professional programmers to help me find solutions. POLISphone is somewhat reliable but still is not solid rock in all browsers and operative systems (that's why I'm a enthusiast coder and not a professional ;) )",
          "answer6": "The many projects involving sound in the web, such as Locus Sonus (https://locusonus.org/soundmap/051/).",
          "social": "https://filipelopes.net",
          "id":"POLISPhone",
          "picid": "polis.png"
        },
        {
          "author": "Dea Bankova",
          "pronouns": "she/her",
          "location": "Tokyo, Japan",
          "title": "I don't like you...",
          "description": "A data art piece about racially and religiously motivated hate crime incidents in London over the last decade.",
          "extradesc": "",
          "live": "https://deaxmachina.github.io/hatecrime_uk_p5/",
          "code": "https://github.com/deaxmachina/hatecrime_uk_p5",
          "type": "Data Visualization",
          "tools": "",
          "difficulty": "Intermediate",
          "answer1": "I am a data scientist turned data visualisation designer and developer, particularly interested in creative viz and data art. Currently based at the University of Tokyo, originally from Bulgaria.",
          "answer2": "Started about 3 months ago when I was learning canvas for data viz purposes and discovered p5. I binge-watched many videos on The Coding Train YouTube channel and got inspired to create some simple sketches, and enter this competition :)",
          "answer3": "I tried to make this project as p5-centered as possible, including the DOM manipulation (I did some of the DOM creation using p5, rather than the normal JS). I used the built-in animation loop of p5 to make the shape move through the years. For the circular shapes, I followed the class-based pattern that I learnt from watching The Coding Train videos. I also learnt about Perlin noise from there (https://youtu.be/Qf4dIN99e2w?list=PLRqwX-V7Uu6bgPNQAdxQZpJuJCjeOr7VD ), and used it both for the ‘veil’ and for the movement of the circles. For the layout arrangement of the circles, I found it easier to use d3.js, as I am familiar with its packing helper functions – see d3.packSiblings in the data.js file in source.",
          "answer4": "From the start, my favourite thing about p5 was the built-in animation loop in the draw() function. It has really helped me wrap my head around animation. I have also started playing with the sound capabilities of p5.sound – it makes a topic that I had no idea how to approach actually straightforward. Also, the built-in Perlin noise and the image capabilities.",
          "answer5": "Yes! I was a beginner when I started this project, and I felt that I learnt a lot from doing it. There are still some bits that I didn’t manage to iron out, mostly to do with responsiveness. I struggled with figuring out how to ‘escape’ the animation loop, where I wanted the ‘veil’ around the circles to keep expanding over time, while the circles updated with the timeline. I found a solution in creating a background behind just the shapes and updating that on each animation loop, essentially erasing the circles, while keeping the ‘veil’.",
          "answer6": "Hard question! There are so many cool things in creative coding, both p5 and other (as I discovered in the last few months). I will simply share one of my new favourite creative coders – I believe she codes in Unity, but a lot of the same can be produced in p5 (maybe?) - https://twitter.com/ojelibalon (Deniz Bicer)",
          "social": "https://deabankova.com/",
          "id":"i-don't-like-you...",
          "picid": "idontlikeyou.png"
        },
        
  
        {
          "author": "Juihung Tseng",
          "pronouns": "he/him",
          "location": "Taipei, Taiwan",
          "title": "Smart Refrigerator",
          "description": "The smart refrigerator plays a medium to convey our mood to our lovers, family, and friends. We could also make friends with the fruit family while exploring the smart refrigerator.",
          "extradesc": "",
          "live": "https://juihungt.github.io/smart-refrig/",
          "code": "https://github.com/juihungt/smart-refrig.git",
          "type": "Camera",
          "tools": "p5.collide2D, ml5.js, textToPoints()",
          "difficulty": "Beginner",
          "answer1": "I am a graduate student majors in real estate development at Pratt Institute. I started to learn to code two months ago.",
          "answer2": "This summer, I participated in an elective course, Creative Coding class, held by Professor Matt Martin. He inspired me, and I am so glad that I started to explore a new field for myself.",
          "answer3": "In this project, p5.js is more like a tool to fulfill the graphic design, and it lets me quickly get familiar with the basic functions in p5.js. The fascinating thing about p5.js is that there are many interactive functions and libraries that would make our projects alive.",
          "answer4": "My favorite feature is PoseNet, the machine learning model. It makes me think about the unlimited opportunities of the disabled’s interaction.",
          "answer5": "PoseNet has some limits for the camera size and position, so I did the scale modification to locate the barcode reader. If I have more time to develop this project, I will simplify my coding. For example, I should use the array to create the different fruit to be more efficient, and maybe they may appear randomly.",
          "answer6": "You may check out how fascinating our eyes could trigger the interaction in the refrigerator.",
          "social": "https://www.linkedin.com/in/juihungt/",
          "id":"Smart-Refrigerator",
          "picid": "smartfridge.gif"
        },
  
        {
          "author": "Keith S. Wilson",
          "pronouns": "he/him",
          "location": "Chicago, IL USA",
          "title": "Re-Binary",
          "description": "This program that translates a word you enter in the “universal” language of binary. Binary can be represented by anything that has two states—we commonly imagine it as 1 and 0 but it can be anything and its opposite. Here I use “yes” and “no,” which creates a kind of dialogue that any person from any culture can understand",
          "extradesc": "I believe love is political but often the message that is communicated is some version of \"love conquers all.\" This is a noble cause, but I think it downplays how dangerous the pursuit of love has historically been for marginalized people, and the struggle that love is even in the best of circumstances. Part of what Re-Binary does is highlight how love, even when attempted to be \"translated\" into black and white terms is still a series of struggles and negotiations: yes-es and no-s as well as intermittent gaps of communication.",
          "live": "This program that translates a word you enter in the “universal” language of binary. Binary can be represented by anything that has two states—we commonly imagine it as 1 and 0 but it can be anything and its opposite. Here I use “yes” and “no,” which creates a kind of dialogue that any person from any culture can understand",
          "code": "https://editor.p5js.org/graphofgrey/sketches/8YExV8HUG",
          "type": "Text",
          "tools": "",
          "difficulty": "Beginner",
          "answer1": "I am a Stegner Fellow in Poetry at Stanford University and an Electronic Literature Organization \"Amplify Anti-Racism Creative\" Fellow. I recently finished the Poets and Scholars Anti-Racism Workshop at Rutgers",
          "answer2": "As part of a digital arts residency at Laboratory Spokane. All my projects are documented there, and through my account at p5js, but my first project was a generator of just the opening (not the racist punchline) of racist jokes that were pulled from an API repository of jokes.",
          "answer3": "A number of links exist in the code of my project, but essentially, I found code for converting ASCII to binary, wrote code to convert that binary to yes (1) and no (0), and then moved on to calculating how to make that text print slowly (and vary depending on the size of it). I also learned how to add GUI elements like a slider that determines text size, and an input box that allows the user to enter any word (not just \"love\")",
          "answer4": "I love the speed at which p5js allows me to mock up a project and test its feasibility. When trying to create digital poetry, one of the issues is that traditional poetry is comparatively very fast both to create something and to change it. \"Mock ups\" (drafts) are very fast and you can explore lots of ideas before you decide to invest your time in one. This is almost never true of computer code (except perhaps if you are an expert coder) and so the thing I love about p5js is that I can quickly create something, see it run, and iterate on that as I would a poem.",
          "answer5": "I was still learning a lot when I created this project, and one of the big challenges I had was in generating text that could be any size but still fill the pre-determined square that I had created (calculating the width of each letter and figuring out how many letters could fit on a line, and then doing the same with its height). This can be done by generating html elements instead of graphical ones, but part of the \"invisible\" intention of this project was to better understand p5hs and javascript in general.",
          "answer6": "My book (Fieldnotes on Ordinary Love) was selected as a notable book by the New York Times! :)",
          "social": "https://keithswilson.com/",
          "id":"Re-Binary",
          "picid": "rebinary.png"
        },
  
        {
          "author": "Rebecca",
          "pronouns": "they/them",
          "location": "Helsinki, Finland / Barcelona, Spain",
          "title": "Networks of Care=Critique",
          "description": "In a context in which most online activity is geared towards distraction and forgetting, this drawing tool reclaims the interface as a site of memory-making. Pop-up monuments to queer and antiracist care and critique, not pop-up windows!",
          "extradesc": "Patrimony of gestures' is an archaeobotany term: it refers to the process of reading plant evidence -found at archaeological sites preserved through carbonisation or imprinted in ceramics- in order to reconstruct the way that ancestors worked and lived with the land.\n\nBut what patrimony of gestures will current reproductive practices leave 'imprinted'? And what occurs when the memory of such reproductive practices is not protected or even actively erased, as is the case with many queer and queer of colour networks of care?\n\nNetworks of Care=Critique is a drawing tool and an on-going ceramics project: friends, activists and colleagues engaged in transfeminist and antiracist organising and alternative family building are asked to reconstruct their networks of care and critique, noting down a range of forms of support – from family, poetry and party to theory and protest – and arranging the information across a traditional genealogical tree format, either chronologically or according to another chosen logic. This information is anonymised if necessary and inscribed in clay.",
          "live": "https://openprocessing.org/sketch/892779",
          "code": "https://openprocessing.org/sketch/892779",
          "type": "Visual",
          "tools": "",
          "difficulty": "Beginner",
          "answer1": "I am a poet, artist and researcher. Since 2014 I've worked with my partner Anyely Marín Cisneros as the artist duo Criticaldías. I'm currently making an animation film to go with an (inter)net.art work I made called 'Classic Gold Premium': all part of my Kone foundation funded PhD artistic research project, which situates the growth of the assisted reproductive technology industry in Europe in the context of intensified migratory control systems and the commercial enclosing of the internet.",
          "answer2": "I started using processing for video mapping in 2016 at Hangar.org in Barcelona, then I experimented with processing  for transforming images into sound in 2017 for Criticaldías video project \"Calling the Magician\".  I took a course at Aalto uni early 2020, which was about using p5.js specifically to write basic drawing software.",
          "answer3": "i used it to write the drawing tool",
          "answer4": "I'm sorry I don't know if I can go into so much detail here, I love the readability and simplicity of the code's structure in general.",
          "answer5": "There was a couple of basic things I had to learn for this tool to work: how to make it so the user can save and download their image as a jpg  / how to make sure the 'ink' didn't disappear so learning about mousepressed function / aesthetically I enjoyed searching for a line colour that is the closest to terracotta, which is the kind of local clay that is most abundant in Barcelona, where this project started.",
          "answer6": "I hope this isn't too self-promotional, but I  have some processing inspired (not p5.js though....) poems in my first poetry collection :) \nhttps://blackspringpressgroup.com/products/valid-virtual-vegetable-reality-by-rebecca-close",
          "social": "http://criticaldias.net/about",
          "id":"Networks-of-Care=Critique",
          "picid": "close.jpg"
        },
  
        {
          "author": "Vineet",
          "pronouns": "he/him",
          "location": "New Delhi, India",
          "title": "Neon Impasse",
          "description": "A musical generative art experiment based on track 1 of the album \"neon impasse\" by city girl.",
          "extradesc": "",
          "live": "https://playriffs.netlify.app/",
          "code": "https://github.com/vineetkl/playriffs/blob/main/sketch.js",
          "type": "Sound",
          "tools": "p5.sound",
          "difficulty": "Intermediate",
          "answer1": "I'm an Undergraduate Design student in Junior year and currently interning at Rakuten",
          "answer2": "I just found it while fiddling around internet; I always wanted to try coding and p5 gave me a huge kickstart because of it's approachability and this creative essence attached to it",
          "answer3": "I used p5 for two main aspects in this project:\n1. Sound - I personally composed and recorded guitar riffs and used p5.sound to add trimmed sections that would play on a keypress along with a visual\n2. Visuals - Studying a lot of p5 projects helped me create exactly what I wanted  be it a falling star, a random star trail, or a flicker",
          "answer4": "push and pop were live saving features in this one; I could bring in a section of draw function at my convienience",
          "answer5": "This was not only my first p5 project but also my first coding/frontend experience so I faced problems in html and css too; to be specific I was struggling with using visuals on top of each other then I got to know later that there's a z-index css property that could fix it.",
          "answer6": "city girl's music",
          "social": "https://www.vineetk.com/",
          "id":"Neon-Impasse",
          "picid": "neon.png"
        },
  
        {
          "author": "Peiling Jiang",
          "pronouns": "he/him",
          "location": "New York, USA",
          "title": "b5",
          "description": "b5 is for learning, prototyping, and accessibility, based on p5.js. Using blocks and wires, non-programmers can quickly build and share creative coding projects with the online editor featuring live coding and embedded documentation.",
          "extradesc": "How will the next generation learn creative coding? Do they have to look up hundreds of pages of documentation and take classes? Do they have to write redundant code for features already well accomplished due to lack of information? Do they have to learn English? b5 rethinks the future of creative coding in terms of clarity, accessibility, and customizability in a world that increasingly emphasizes remote collaboration, internationalization, and personalized learning. b5 is a web-based visual programming language for learning and fast prototyping for people with minimal to no programming experience, leveraging novel features compared to other visual programming languages, including (1) position-based sequential execution (blocks are executed in order based on their positions in the code canvas), (2) customized blocks (users can use the predefined blocks and the graphical interface to design and construct new blocks), and (3) effect blocks (block that affects other code blocks based on their contextual relationship instead of wire connection). b5 makes programming easy to learn and encourages programmers to explore and try, while more analysis is needed to assess its usability and long-term effects when used as the learning platform for beginners. Please visit https://www.jpl.design/b5 to learn more about this project.",
          "live": "https://b5editor.app/",
          "code": "https://github.com/peilingjiang/b5",
          "type": ["Educational", "Tool"],
          "tools": "",
          "difficulty": "Advanced",
          "answer1": "I am a recent graduate from NYU double-majored in Interactive Media Arts and Psychology. I am interested in building efficient and actuating novel interfaces in the field of human-computer interaction.",
          "answer2": "I started learning p5.js (and ml5.js) in a class called Intro to Machine Learning for Arts with Daniel Shiffman. My first project was a game where people need to move their heads around to eat healthy food (https://blog.jpl.design/posts/f19/machine-learning-for-the-arts/more/apple/).",
          "answer3": "p5.js is at the core of this project, both conceptually and technically. The project was inspired by p5.js and its idea of bringing creative coding to a larger community and leveraged many of its designs, e.g., the fundamental \"setup-and-draw\" structure. Lingdong's q5.js project also makes it perform better.",
          "answer4": "I love `lerp()`! Many math functions, e.g., `dist()`, are also super helpful.",
          "answer5": "I encountered a great many technical issues during the development process. However, I solve them all by myself, with help from online communities, like Stack Overflow.",
          "answer6": "Coding Train!",
          "social": "https://peilingjiang.com",
          "id":"b5",
          "picid": "72.png"
        },
  
        {
          "author": "Priyanshu Kumar",
          "pronouns": "he/him",
          "location": "New Delhi, India",
          "title": "2-D Animation of a shape",
          "description": "Heart shape created by using mathematical formulas and animating back and forth. So! cool to see. I'll eventually add more in this project.",
          "extradesc": "",
          "live": "https://virusinlinux.github.io/heartAnimation/",
          "code": "https://github.com/virusinlinux/heartAnimation",
          "type": "Visual",
          "tools": "stroke(),",
          "difficulty": "Beginner",
          "answer1": "I'm a second year student at GGSIPU(Bhagwan Parshuram Institute of Technology) pursuing B-Tech in Information Technology branch.",
          "answer2": "I was always excited about java script and started learning Java script from beginning of my college days. Then on randomly surfing about p5.js. That it is a JavaScript library for creative coding. Then I started learning slowly practicing from articles, books and some youtubers. And now I'm pretty descent in this tech.",
          "answer3": "I was interested in making shapes with mathematical equations and want to implement some shapes using this library. So, I choose this Heart-Curve\nI have got the major help from: \nlink: shorturl.at/cuSX8",
          "answer4": "I have some of my favorite functions and camera() is one of them. It sets the camera position for a 3D sketch.",
          "answer5": "Got some problem over making the mathematical equation work in the real world but it was also fun making these cool projects, and I read some books about the concepts and some articles for that and finally solved the bugs, at the end I love p5.js very much.",
          "answer6": "https://virusinlinux.github.io/DysonSphere.github.io/",
          "social": "https://www.linkedin.com/in/priyanshu-kumar-8852bb1a0/",
          "id":"Heart-Animation",
          "picid": "71.png"
        }
    
      ]
  }