{
  "viz2.1": "self-learners",
  "viz2.2": "and artists, game makers, creative-technologists, designers, illustrators, architects, graphic designers, graphics editors, app designers, project managers, software engineers, students, teachers, university faculty members, design researchers.",
  "viz2.3": "w/ all kinds of experiences",
  "Directionsmap": "Click on the stars to learn more!",
  "Directions": "Click on the pink text to change graphs!",
  "Directions2": "Press space to interact with this visualization!",
  "Created By": "Created By",
  "2020Gallery_Intro": "To learn more about the project and how it was made, click on the image of each card preview. \n\nFeel free to leave feedback or a comment in our [guestbook](https://forms.gle/Mxb2thi2k27EZ3Mo7)!",
  "Project Links": "Project Links",
  "Visualizations": "Visualizations",
  "Projects": "Projects",
  "Social Media": "Social Media",
  "Tools": "Tools",
  "Live": "Live",
  "Code": "Code",
  "About1": "What is the p5.js Showcase?",
  "About2": "How is it organized?",
  "About3": "What else should I check out?",
  "Acknowledgements": "Acknowledgements",
  "Acknowledgements_Description": "I'd like to thank [GSoC](https://summerofcode.withgoogle.com/) and the [Processing Foundation](https://processingfoundation.org/) for allowing me to see this project through. I'd also like to thank my wonderful mentor Rachel Lim for all of her unwavering (emotional and technical) support through the whole process. I'd also like to shout-out Qianqian Ye, Katie Chan, and Connie Liu for all of their advice and input.  Lastly, I'd like to thank all the p5 maintainers and contributors for helping me with this project and for being a part of this whole journey 💗",
  "Answer1": "The p5.js Showcase is an online gallery of work created with [p5.js](https://p5js.org/), an open source creative computing library. It was created by [Ashley Kang](https://ashleykang.dev) in 2019 ([view the 2019 Showcase here](https://p5js.org/showcase/)), previously curated by [Connie Liu](https://connieliu0.github.io) in 2020 ([view the 2020 Showcase here](/#/showcase2020)) and [Katie Chan](https://katiechan.cargo.site/) in 2021 ([view the 2021 Showcase here](/#/showcase2021)). It's currently maintained by [Annie Zheng](https://www.annieyuqizheng.com/). \n \n The purpose of the Showcase is to celebrate how people are using and learning p5.js to make creative work with the aim of conveying our core values of inclusivity.",
  "Answer2": "Usually the p5.js will open up a call for submissions via [Twitter](https://twitter.com/p5xjs) or [Instagram](https://www.instagram.com/p5xjs/)! For the past three years, the Showcase has been run as a [GSoC project](https://summerofcode.withgoogle.com/). In addition, this year's showcase was organized and curated based off of a specific theme.",
  "Answer3": "Make some sketches of your own with the [p5.js editor](https://editor.p5js.org/), discover more with [OpenProcessing](https://www.openProcessing.org/), and learn more with the [Coding Train](https://www.youtube.com/user/shiffman), [sosunnyproject] (https://www.youtube.com/channel/UCKNXAqIvqc25JJ1CWdayqBA), and [Xinxin] (https://www.youtube.com/channel/UCufOCDs5G1A4AffwmeV0XBw)!",
  "Question1": "What are you up to?",
  "Question2": "How did you get started with p5.js?",
  "Question3": "How did you use p5.js in this project?",
  "Question4": "What's your favorite p5.js feature?",
  "Question5": "Did you face any challenges working on this project? If so, how did you overcome them?",
  "Question6": "What's a cool thing we should check out?",
  "Archiveabout": "The p5.js Showcase was started by Ashley Kang in the summer of 2019 and has continued on each summer since. View or read more about each project below!",
  "2019about": "Curated by [Ashley Kang](https://ashleykang.dev/) in the summer of 2019, below is the first ever curated collection of the p5.js Showcase! Learn more about each one by clicking on the preview. [View the original implementation here!](https://p5js.org/showcase/)",
  "About": "About the p5.js Showcase",
  "Connect2022": "<C*NNECT>",
  "Welcome2022": "Welcome to the p5.js 2022 Showcase!",
  "CreatedBy2022": "Curated by Annie Zheng",
  "TemplateBy2022": "Gallery Layout and Visualizations by Connie Liu",
  "Welcome": "Welcome to the p5.js 2022 Showcase",
  "2022-about-heading": "about",
  "2022_intro1": "During Summer 2022 we asked the global p5.js community to submit their work for a showcase that was centered around the theme of <CONNECT>. Specifically, we wanted to encourage community members, especially newer coders, to connect with each other through their ideas and their work, with an added focus on each person’s learning process, and the ability to use the showcase to learn.",
  "2022_intro1.5": "Here, you'll find a diverse array of work that interpret connection through p5.js, demonstrating how p5.js supports a diverse community of coders from all-levels through an accessible site. As the curator of this year's showcase, I am truly in awe of the variety of creative ways p5.js was used and I am super excited to finally present the p5.js community’s work to everyone. I hope you enjoy browsing this showcase as much as we enjoyed curating it!",
  "2022_intro2": "Learn more about the p5.js community below!",
  "Viz1": "this year we got submissions from...",
  "Viz2": "our submitters are...",
  "Viz3": "to them p5.js is...",
  "Viz4": "view the projects →",
  "Jump to": "Jump to:",
  "filter by": "filter by",
  "filters": [
    { "name": "All" },
    { "name": "Visual" },
    { "name": "Data Visualization" },
    { "name": "Game" },
    { "name": "Text" },
    { "name": "Sound" },
    { "name": "Educational" },
    { "name": "Camera" }
  ],

  "difficulty": [
    { "name": "Beginner" },
    { "name": "Intermediate" },
    { "name": "Advanced" }
  ],

  "archive": [
    {
      "id": "2020-showcase",
      "title": "p5.js 2020 Showcase",
      "image": "qtv.png",
      "description": "Curated by Connie Liu"
    },
    {
      "id": "2019-showcase",
      "title": "p5.js 2019 Showcase",
      "image": "airi-flies.png",
      "description": "Curated by Ashley Kang"
    }
  ],

  "showcase2022": [
    {
      "author": "Jason Gong",
      "pronouns": "he/him",
      "location": "Brooklyn, USA",
      "title": "The Healing Forest",
      "description": "A web-based interactive experience to promote mental health awareness.",
      "alt": "The image shows the player's character in the middle of a forest at night, and it is raining. The character is a black circle with two big eyes looking towards the front. White light glows around the character with a spotlight shines the nearby area.",
      "live": "https://jasongong0307.github.io/the-healing-forest/",
      "code": "https://github.com/jasongong0307/the-healing-forest",
      "type": "Game",
      "tools": "p5.sound,  touchEnded(), lerp(), push(), pop(), loadPixels(), updatePixels()",
      "difficulty": "Intermediate",
      "answer1": "I'm a UX Designer and a recent graduate of the MFA Communications Design Program at Pratt Institute.",
      "answer2": "My first encounter with p5.js is at the Creative Coding class in the MFA ComD program at Pratt Institute. In this class, professor Matt Martin taught me from the very basics of drawing primitive shapes to writing my own functions with generative codes within a semester.",
      "answer3": "The entirety of this project, including the user interface and visual assets, is written in p5.js. The game environment is procedurally generated on top of a custom isometric grid using objects and classes. At the same time, the animation of NPCs relies on the Perlin noise algorithm to power their unique characteristics. In addition to the class materials provided by Matt Martin, I learned a lot about coding through The Nature of Code website and tutorials by Daniel Shiffman. Other references can be found at the top of the main.js file in the project repository.",
      "answer4": "My favorite function is the map() and constrain() because of how we can use them to interpret different values into other meaningful stimuli. I also plan to explore other functions such as loadJSON() to incorporate databases or the p5.serialport library for my next experimentation with ambient computing and interaction design for IoT.",
      "answer5": "I faced many performance issues due to how resource-intensive it is to generate a large playable area and draw all the game objects in the scene. So much of my time went into optimization by ensuring that some visual effects, such as the rain or the water ripples, won't get drawn outside the viewing area. In addition, I struggled a lot with how to create real-time shadows for my moving game objects. But I was lucky to come across the CanvasRenderingContext2D from the Canvas API, which allows me to render 2D shadows and maintain a higher framerate. I also didn't know how to code graphic shaders, so I had to work with a few basic functions to draw the scene. The key lesson I got from this project is organization. If you ever feel that your task is overwhelming, separate your goal into smaller chunks and work on it one step at a time. This way, the work will be more enjoyable, and you will also have a coherent structure of codes.",
      "answer6": "A project by Yuri Suzuki: https://soundoftheearth.org/",
      "social": "https://www.jasongong.design/",
      "id": "the-healing-forest",
      "picid": "healing-forest.jpeg"
    },

    {
      "author": "Arjun",
      "pronouns": "he/him",
      "location": "Mumbai, India",
      "title": "In Between Life & Death",
      "description": "In Between Life & Death tries to answer why humans are motivated to do what they do. You wake up as a particle in space animated by consciousness. As you progress through life, you're compelled by different needs. All to reach a grand ending. But is there one at all? \n\nThis unifying, underwhelming nature of life is what I wanted to highlight in the game. Isn't this what connects us all?",
      "alt": "A digital banner for the game. Features two blobs, i.e: the Hero and its partner being attacked by hostile particles with the text 'In Between Life & Death' written in a serif font.",
      "live": "https://arjuncreates.github.io/InBetweenLifeAndDeath/",
      "code": "https://github.com/arjuncreates/InBetweenLifeAndDeath",
      "type": "Educational",
      "tools": "p5.sound, lerp(), alpha(), float(), int(), mouseX, mouseY, mousePressed(), mouseReleased(), p5.Vector, map()",
      "difficulty": "Intermediate",
      "answer1": "I recently graduated from the Indian Institute of Art & Design, New Delhi with an undergraduate degree in visual design. For the last 6 months, I was part of the Xperimenters programme at Science Gallery Bengaluru. Next week, I start my full time job as a Design Researcher at TinkerLabs, Mumbai (India).",
      "answer2": "The internet, Visual Programming (Cox & Soon) and Daniel Shiffman.",
      "answer3": "Made the entire game on p5.js. I also have a repository of 59 sketches that were used to conceptualise the game, that can be found here: https://editor.p5js.org/arjuncodes/collections/DN8GBte3W",
      "answer4": "So tough to choose a favourite. I guess any that add interactivity, such as mousePressed(), mouseReleased(), mouseX, mouseY, Camera input etc.",
      "answer5": "It was incredibly challenging.",
      "answer6": "An explainer video of the project: https://youtu.be/Wc06UFbB8D8 \n\nTrailer for the game: https://youtu.be/HrHS1g1aeno",
      "social": "www.arjunyadav.info | Instagram: @arjunsarchive",
      "id": "in-between-life-and-death",
      "picid": "IBLD-1.jpeg"
    },

    {
      "author": "Summer Chao",
      "pronouns": "she/her",
      "location": "Chicago, USA.",
      "title": "Marvel's Flow Field",
      "description": "A grid of vector twists and turns into different images of Marvel superhero. Each point in the grid connects with one another over space and time",
      "alt": "A distribution of vector points consist of an image of Iron Man",
      "live": "https://sssummerchao.github.io/Marvel-s-flow-field/",
      "code": "https://github.com/sssummerchao/Marvel-s-flow-field",
      "type": "Visual",
      "tools": "mousePressed(), map(), noise(), createVector()",
      "difficulty": "Intermediate",
      "answer1": "I am a product designer currently looking for work opportunities.",
      "answer2": "College course.",
      "answer3": "I started by creating a very simple grid and flow field. Eventually I has the idea of transferring image pixels onto a grid of vectors. Here's my first draft: https://editor.p5js.org/summerchao/sketches/ztGPg8FM9 Then I attempted to make each pixel moves and here's my attempt: https://editor.p5js.org/summerchao/sketches/vOZRlHrfP. Then I just adjusted the noise level and direction of the pixel for my final result.",
      "answer4": "Love the camera and loop feature. I also often use p5 sound library to play with different audio inputs",
      "answer5": "When users click through all the images on the web page, it won't restart to the first image. So I have to add this line of code: \nif (pos >= allimages.length) {\npos = 0;\n}",
      "answer6": "https://swiftui.design/",
      "social": "https://notwinter.notion.site/notwinter/This-is-not-winter-4e3f503cee444e4c830a5fd812672b36",
      "id": "marvels-flow-field",
      "picid": "marvel.png"
    },

    {
      "author": "Noah Breedy",
      "pronouns": "he/him",
      "location": "Warwick, USA",
      "title": "Rope Simulation",
      "description": "A simple rope simulation using vertlet integration.",
      "alt": "White lines and circles assembled in the shape of a hanging, waving cloth, on top of a blue background.",
      "live": "https://editor.p5js.org/Blungus23/full/AhwUOIm9O",
      "code": "https://editor.p5js.org/Blungus23/sketches/AhwUOIm9O",
      "type": "Educational",
      "tools": "createVector()",
      "difficulty": "Intermediate",
      "answer1": "I am an independent computer science student looking to focus on developing creative programs that are fun to interact with.",
      "answer2": "I first learned about p5 from the codingtrain YouTube videos, and my first every project was a code along with the snake game.",
      "answer3": "I use p5.js for all of the vector math as well as all of the rendering in this project.",
      "answer4": "My favorite function would have to be the createVector() function funnily enough as it enables so many cool real world phenomena to be simulated.",
      "answer5": "The problems I faced when doing this project would have to be the unique rendering as it was kind of hard to figure out to properly draw each point to the screen.",
      "answer6": "You guys should check out The Rehearsal by Nathan Fielder its pretty funny.",
      "social": "Instagram: @noahbreedy",
      "id": "rope-simulation",
      "picid": "rope-simulation.png"
    },

    {
      "author": "Jun",
      "pronouns": "he/him",
      "location": "Shanghai, China",
      "title": "The Love Story",
      "description": "Love can make life colorful and bright, but sometimes it can make life black as well.",
      "alt": "Handdrawn red anatomical heart with blue outline in the center. Elongated pink and purple ellipses surround the heart.",
      "live": "https://vimeo.com/739001520",
      "code": "https://editor.p5js.org/FantasticJun/sketches/JNW0Rd6rf",
      "type": "Visual",
      "tools": "",
      "difficulty": "Beginner",
      "answer1": "I am an Illustrator and animator and it is my first project on NYU IMA.",
      "answer2": "On creative coding class.",
      "answer3": "I have another version which use force sensor linking to the Arduino to control the distance of two balls.The reason why I choose force sensors is that they are really sensitive and hard to control, which is just like the difficulty of controlling the comfortable distance in a relationship.",
      "answer4": "map().",
      "answer6": "my home page on behance! https://www.behance.net/fantasticjun",
      "social": "https://www.behance.net/fantasticjun",
      "id": "the-love-story",
      "picid": "love-story.png"
    },

    {
      "author": "Sikai Li",
      "pronouns": "he/him",
      "location": "Paris, France",
      "title": "Cave",
      "description": "Cave is an audio-visual experience, the images are created by the artiste in advance  and are transformed in realtime, reacting to the frequencies of the music.",
      "alt": "GIF of black lines with gray fill drifting towards the top of the screen, on top of a black background.",
      "live": "https://skyl.fr/play/cave",
      "code": "https://github.com/sikaili",
      "type": "Visual",
      "tools": "noise()",
      "difficulty": "Intermediate",
      "answer1": "I'm an artist and coder, currently based in Paris, I explore the intersection of interactive visuals and experimental music.",
      "answer2": "I started p5.js with Daniel Shiffman's course on Kadenze, my first project was a simple face sketch.",
      "answer3": "I started a simple drawing tool longtime ago, with p5.js, which is still available here https://skyl.fr/play/noise-draw, then I began to have many sketches done with this drawing tool, I decided to do another sketch to use all those materials, to create a more immersive experience with sound and distortions.",
      "answer4": "noise()",
      "answer5": "The sketches. I had to accumulate during a long-time to have enough materials.",
      "answer6": "Tone.js",
      "social": "https://skyl.fr",
      "id": "cave",
      "picid": "cave.gif"
    },

    {
      "author": "morais",
      "pronouns": "he/him",
      "location": "Campina Grande, Brazil",
      "title": "a train ride",
      "description": "seat back, relax and enjoy this chill train ride with the sea and the sunset as the background",
      "alt": "A white pixel-art train moving slowly on the trails while the sun sets behind the sea on the background.",
      "live": "https://editor.p5js.org/reajmorais/full/8UxKOWank",
      "code": "https://github.com/reajmorais/a-train-ride",
      "type": "Audio",
      "tools": "",
      "difficulty": "Beginner",
      "answer1": "I'm a computer sciente undergraduate and a freelancer artist. I'm also studying front-end development and UX/UI online.",
      "answer2": "Through an online course.",
      "answer3": "I mainly used p5js in this project to load the assets and create the infinite parallax movement. The assets were made using Aseprite, and Krita to add the noise effect.",
      "answer4": "I'm really green at p5, but I really like the ease of use of the library, and the freedom the references and libraries give even to beginners like me.",
      "answer5": "Yes. The infinite parallax was a really hard thing to figure out. I tried for a few hours to create a code structure that could give me a smooth parallax.",
      "answer6": "I really liked the song by Engelwood. The link to the artist's profile on Slip.stream is on the README file!",
      "social": "https://www.linkedin.com/in/renato-morais-a24558217/, instagram.com/reajmrs",
      "id": "a-train-ride",
      "picid": "train-ride.png"
    },

    {
      "author": "Shawn Peters",
      "pronouns": "he/him",
      "location": "Bay Roberts, Newfoundland, Canada",
      "title": "Visual Synonyms",
      "description": "Takes a user input word and generates levels of synonyms from that word.",
      "alt": "A gif showing the growth of a web of synonyms centered around the word 'happy.'",
      "live": "https://editor.p5js.org/shawnpeters/full/F7KwxeMGt",
      "code": "https://editor.p5js.org/shawnpeters/sketches/F7KwxeMGt",
      "type": ["Camera", "Educational", "Tool"],
      "tools": "",
      "difficulty": "Intermediate",
      "answer1": "I'm a high school teacher who teaches science and computer science. I have always had an interest in computer programming and have been exploring Python and Javascript to create artwork.",
      "answer2": "Through creative coding challenges. It was an easy way to create and share code.",
      "answer3": "p5.js was used for the displaying of the text elements.",
      "answer4": "I enjoy the live coding features. It's useful to see how the output changes as you modify code. The built in functions such as random() simplify some of the javascript syntax.",
      "answer5": "This was the first time I worked with fetch() and asynchronous functions. I used many websites and youtube videos to work my way through the learning process.",
      "answer6": "https://editor.p5js.org/shawnpeters/full/BB09CGxEg A project I recently made that I'm really proud of.",
      "social": "https://www.facebook.com/PetersPythonicProjects, https://twitter.com/SpaceNewfie",
      "id": "visual-synonyms",
      "picid": "visual-synonyms.gif"
    },

    {
      "author": "Jenny Kowalski",
      "pronouns": "she/her",
      "location": "Philadelphia, USA",
      "title": "Creative Coding Every Day: Genuary 2022",
      "description": "An article about my experience participating in 'Genuary 2022' and making something using creative code everyday in the month of January. The article includes embedded sketches and links to the code for the projects I made, primarily in p5.js.",
      "alt": "Image of dense overlapping lines that make squares that rotate in 3D space.",
      "live": "https://jennybkowalski.medium.com/creative-coding-every-day-genuary-2022-25b7e7c11bf5?sk=b8a1cab9b48a7ceba9ebef02b3583c58",
      "code": "https://jennybkowalski.medium.com/creative-coding-every-day-genuary-2022-25b7e7c11bf5?sk=b8a1cab9b48a7ceba9ebef02b3583c58",
      "type": "Tutorial",
      "tools": "map(), random()",
      "difficulty": "Intermediate",
      "answer1": "I'm a Professor of Graphic & Interactive Design at Tyler School of Art & Architecture at Temple University in Philadelphia. I teach a variety of design classes including a 'Creative Coding' class in which designers experiment with creative code and new technologies.",
      "answer2": "My first p5.js project was in graduate school, I had heard of processing and wanted to make something with it, but I wanted a way to share it on the web. 'The Coding Train' taught me how to work in p5 for that project and I fell in love with working in p5.js.",
      "answer3": "A variety of sketches in this collection are made in p5js, A few sketches use other tools including RunwayML, Photoshop, Procreate, and felt and paper.",
      "answer4": "As a graphic designer, I love how saveCanvas() allows me to save a file of what I make to turn into something else using my other design tools.",
      "answer5": "I had a TON to learn to make these projects everyday, and it took a lot of work. The tutorials and resources from the p5js community were essential to my overcoming these obstacles! Some of my favorite sketches in the project started from a remix of someone else's code or from following a tutorial.",
      "answer6": "p5.svg: https://github.com/zenozeng/p5.js-svg",
      "social": "https://www.jennybkowalski.com/, https://www.instagram.com/jennybkowalski/, https://jennybkowalski.medium.com/",
      "id": "creative-coding-everyday",
      "picid": "creative-coding-everyday.jpeg"
    },

    {
      "author": "Yewon Jang",
      "pronouns": "she/her",
      "location": "Seoul, Korea",
      "title": "RoBeat Dance",
      "description": "While thinking about how to solve robot dance, I thought that dance is a genre that is related to music. So I wanted to relate the beat and robot animation among the components of music. I try to visualize the beat through the robot's movement. Also, I want to make educational material for young children when they learn about the music. Program is consist of two features. One is beat maker and one is robot dance. The components of the drum beat were connected to the robot's body. You can drag-drop the beat block to beat score. I divided robot for three components. (Head, Arm, and Leg). Each component takes an action to match the call of the beat.",
      "alt": "Purple cartoon robot moving its head while the user's mouse clicks square buttons titled 'leg,' 'arm,' and 'head.'",
      "live": "https://editor.p5js.org/yewon1135/full/PgNQYzxMB",
      "code": "https://editor.p5js.org/yewon1135/sketches/PgNQYzxMB",
      "type": "Audio",
      "tools": "p5.sound",
      "difficulty": "Intermediate",
      "answer1": "I'm major in Art&Technology, Sogang Univ in Korea. I am passionate about interactive media art and creative code art, and activity related to the convergence of science and art.",
      "answer2": "I learned p5.js in my school lessons.",
      "answer3": "I used p5.js to make a background video of media art performance. Also, I used for making intro for concept videos.",
      "answer4": "My favorite function is blendMode(), and I like p5.js support the mobile version.",
      "answer5": "Lack of basic knowledge of JavaScript made it difficult to access p5.js for the first time. And there were difficulties in solving p5.js errors alone because they did not appear much when I typed it on Google.",
      "social": "https://www.instagram.com/yeahwon__zip/, https://outrageous-brace-1db.notion.site/Yewon-Jang-49837189831b4d57b4ea7a5613c4cc4e",
      "id": "robeat-dance",
      "picid": "robeat.gif"
    },

    {
      "author": "EvS",
      "pronouns": "she/her",
      "location": "Athens, Greece",
      "title": "raInBoWWarM",
      "description": "An error can be fixed with a click. And a click can bring a rainbow in a summer day! A graphic design and typography mix art illustrating an error in a random color that disappear according to the sum of its RGB values and then cycles that follow the mouse and change colors from red to green to blue to red appears! if you click, unless you get a circle with the text click, to motivate you click. If you double click the canvas becomes a bit darker and it resets.",
      "alt": "blue text that says 'error' mixed with white circles and white text that says 'click' on top of a gray background.",
      "live": "https://editor.p5js.org/evitasima/sketches/S92eP2WYQ",
      "code": "https://editor.p5js.org/evitasima/sketches/S92eP2WYQ",
      "type": "Data Visualization",
      "tools": "map()",
      "difficulty": "Beginner",
      "answer1": "I am a young architect doing internship in Barcelona attracted by coding",
      "answer2": "I was introduced from the TIE Academies, a series of seminars organized by TUC TIE Lab.",
      "answer3": "This project was created in order to het familiar with the p5.js. And inspired by a rainy summer evening in Barcelona and all the wrong decisions I took that evening.",
      "answer4": "I guess the for loop. I used a lot....and also I Love the ability to use a web cam!",
      "answer5": "The hardest part was to make the changes of colors. I analyzed it on paper and then I wrote the code.",
      "answer6": "Click when the canvas says so and double click when you want to reset",
      "social": "https://www.instagram.com/evitasima/?hl=en",
      "id": "raInBoWWarM",
      "picid": "rainbow.jpeg"
    },

    {
      "author": "Arya Harditya",
      "pronouns": "he/him",
      "location": "Jakarta, Indonesia",
      "title": "Mandala Shatters",
      "description": "The concept of this project is to project the sketch into an immersive room where the camera recorded audience and have them shatters around the screen.",
      "alt": "Mandala shatter created using Starbucks logo from the webcam feed. Shatters are on top of a black background.",
      "live": "https://openprocessing.org/sketch/1620353",
      "code": "https://openprocessing.org/sketch/1620353",
      "type": "Visual",
      "tools": "texture()",
      "difficulty": "Beginner",
      "answer1": "I'm a design lecturer at Sampoerna University in Jakarta, Indonesia. On my spare time, I'm freelancing for brand design projects.",
      "answer2": "i started when i was doing my post-graduate thesis, where i was using Processing to code some Batik-theme visuals and decided to switch to p5js because i can do it online without installing yet another software. It is modular to work with p5, i can combine p5 libraries as well as other external libraries.",
      "answer3": "Firstly i tried to create Mandala pattern by using vertex() and separate it into a class. Afterwards, i applied WEBGL mode so i can rotate the Mandala in 3D space, then i applied texture() to a live webcam feed (createCapture())to make it physically interactive for the user(s).",
      "answer4": "I love many things about p5js, my favorite functions are dist(), map(), lerp(), createVector() and texture().",
      "answer5": "I already have a solid idea in mind which is the Mandala, but frankly the challenge comes since the beginning when creating the Mandala. I'm still practising my computational thinking, so i had to find resources, thanks to Computational Mama and Steve's Makerspace for getting me started with the logic!",
      "answer6": "i think you should check out p5.xr and develop it more because we are entering metaverse, and I need p5js in building my own metaverse! :D",
      "social": "https://www.linkedin.com/in/aryaharditya/",
      "id": "mandala-shatters",
      "picid": "mandala.jpeg"
    },

    {
      "author": "Amy Goodchild",
      "pronouns": "she/her",
      "location": "London, United Kingdom",
      "title": "Flock",
      "description": "Flock is a multiplayer online experience where you can create clouds of bubbles and interact with them. Simultaneous visitors are paired up to play together in real time - an opportunity for a distanced interaction with a stranger. There is more information here - https://www.youtube.com/watch?v=fZ25GQU-o0w",
      "alt": "Two sets of coloured dots fly around the screen.",
      "live": "https://in.bimble.space/flock",
      "code": "https://in.bimble.space/flock",
      "type": "Educational",
      "tools": "",
      "difficulty": "Advanced",
      "answer1": "I'm a generative and interactive artist based in London. I use technology to create installations and screen based work.",
      "answer2": "I learnt Processing in 2016 to create an interactive tunnel filled with 5760 LEDs. People could walk inside the tunnel and use a touchscreen to control the lights. I used Fadecandy chips to drive the LEDs, which worked with Processing. I then got more into p5js in 2020 when lockdown meant web based art made more sense.",
      "answer3": "This video goes into all the detail you could dream of - https://www.youtube.com/watch?v=fZ25GQU-o0w",
      "answer4": "I think my favourite feature is the community and the documentation. I love that anything I want to do, I can google it and find someone asking a similar question, or I can ask in a discord/slack and find some help.",
      "answer5": "I had never used node.js, socket.io or anything server based before so there was a steep learning curve for me on this project. I fully thought it would turn out to be beyond me but I gave it a go anyway.",
      "answer6": "Nowhere is a Spanish regional burn (like burning man) and it's another great community. https://www.goingnowhere.org/",
      "social": "www.amygoodchild.com | https://twitter.com/amygoodchild | https://www.instagram.com/amy_goodchild/",
      "id": "flock",
      "picid": "flock.png"
    },

    {
      "author": "Katie Liu",
      "pronouns": "she/her",
      "location": "Los Angeles, USA",
      "title": "Sing Together",
      "description": "Sing with your friends and watch cool, colorful shapes appear! Your voice will appear as circles and your friends' as squares. The size of the shape depends on how loud you are singing. I also included some of my favorite karaoke songs to play as inspo! FYI sadly this website only runs on Chrome web.",
      "alt": "Black screen with colorful designs as the background. Randomly colored colorful circles and squares appear.",
      "live": "https://singtogether.glitch.me/",
      "code": "https://glitch.com/edit/#!/singtogether",
      "type": "Code",
      "tools": "p5.AudioIn()",
      "difficulty": "Beginner",
      "answer1": "I'm starting my senior year at USC soon!",
      "answer2": "My professor, Professor Q, introduced me to p5.js in my coding class for Media Arts + Practice at USC.",
      "answer3": "I used p5.js to receive audio input for the project! I used it to decipher the volume of this audio and to draw shapes!",
      "answer4": "I love random(255) for a random color haha.",
      "answer5": "I made this project with the guidance of my Professor in the class I was taking. My Professor offered a lot of guidance and I used a lot of YouTube vids from Daniel Shiffman.",
      "answer6": "The Creative Code Collective! https://creativecodecollective.github.io/",
      "social": "https://katieliu.art/",
      "id": "sing-together",
      "picid": "singtogether.png"
    },

    {
      "author": "SEJIN OH",
      "pronouns": "he/him",
      "location": "Seoul, Korea",
      "title": "Open Source Lab Webpage's Interactive Motion",
      "description": "열기/닫기 아이콘 \n\nI designed and developed the Open Source Lab web page of Hongik University's Interactive Media Art Crew! It was designed with a simple but bouncy mood of open source lab, and the interaction was made with cute logo figures of open source lab on the main page's background. \n\nDeveloped by html + css + p5.js \n\n🖥 Link : hi-oslab.github.io",
      "alt": "GIF of a circle, triangle, and three stacked rectangles moving around a browser window.",
      "live": "https://hi-oslab.github.io/",
      "code": "https://github.com/hi-oslab/hi-oslab.github.io/blob/main/js/canvas.js",
      "type": "Visual",
      "tools": "beginShape()",
      "difficulty": "Beginner",
      "answer1": "I am studying interaction design in the Department of Design Conversions at Hongik University in Korea. I am studying the harmony of design and technology through fun libraries such as p5.js and studying interactions that anyone can easily access!",
      "answer2": "My first p5.js work was to translate my work from processing into the web so that anyone could experience it.",
      "answer3": "I compared the reference of p5.js Korea web page with the processing reference page and did the translation work!",
      "answer4": "I like the functions related to mobile events in p5.js and enjoy doing web art using mobile acceleration's events.",
      "answer5": "The difficulty was my lack of web development knowledge and I could solve this problem by watching YouTube's coding train online lecture!",
      "answer6": "The simplicity and friendly web editor of p5.js made it easy for anyone to get over the fear of programming!",
      "social": "https://designersejinoh.web.app",
      "id": "open-source-lab-webpage-interactive-motion",
      "picid": "osl.gif"
    },

    {
      "author": "Cristiano Figueiró",
      "pronouns": "he/him",
      "location": "Salvador, Brazil",
      "title": "Música Móvel",
      "description": "This is a research project for experimentation and development of an online audio sample remix platform. In this version we used P5.js to create the visual interface and Tone.js for the audio engine. In this version it is possible to automate audio slicing and loop sections while manipulating the live interface.",
      "alt": "Shows the waveform of 2 audio files with control buttons on the left side of each audio. At the top there are buttons to switch between project tabs and the 'Play' and 'BPM' controls.",
      "live": "http://cristianofigo.github.io/musica_movel_web/",
      "code": "https://github.com/cristianofigo/musica_movel_web",
      "type": "Audio",
      "tools": "p5.gui",
      "difficulty": "Intermediate",
      "answer1": "I am a computer music researcher and work as a professor of art and technology at the Federal University of Bahia (UFBA) in Salvador, Bahia, Brazil.",
      "answer2": "I studied Processing for a while but my research focus was around the Pure Data community developing software for sound creation. I've been experimenting with P5.js and javascript for sound creation for 1 year.",
      "answer3": "My previous study of Processing paved the way for me to study and experiment with P5.js and guided me towards using Tone.js as an audio engine and combining P5.js with Tone.js to produce a very refined audio control experience in browser.",
      "answer4": "I love the p5.js web editor, very fast and easy to sketch and experiment ideas.",
      "answer5": "Yes, this project is still a work in progress, the user interface and controls are still very raw and slow and should be optmized thru iterations design.",
      "answer6": "This work is a continuation of an older research about sound creation apps for android platform: www.musicamovelbahia.wordpress.com",
      "social": "www.cristianofigo.wordpress.com, https://www.instagram.com/musicamovelbahia/",
      "id": "musica-movel",
      "picid": "musica-movel.gif"
    },

    {
      "author": "Joo",
      "pronouns": "she/her",
      "location": "Toronto, Canada",
      "title": "✿ me & you, then us ✿",
      "description": "an animated p5 sketch to visually communicate my feelings between 'me' and that special 'you,' and then 'us' together. This sketch is a marriage between type, shapes, color, & transformations. Contains rapidly moving visuals, therefore, may need possible disclaimer.",
      "alt": "An explosion of the text 'you' and soft pink flowers rotating around the text 'me' which is centred in the middle of a black canvas.",
      "live": "https://editor.p5js.org/jooprojects/full/Y6T0202my",
      "code": "https://editor.p5js.org/jooprojects/sketches/Y6T0202my",
      "type": "Visual",
      "tools": "WEBGL, rotateX()",
      "difficulty": "Beginner",
      "answer1": "Digital media student interested in mixed reality (MR), digital accessibility, creative coding, and design research. Always trying to experiment with new digital tools.",
      "answer2": "So sun park (although she does not know, I never saw creative coding in its works until I came across her instagram). Attended CC Fest, then helped organize CC Fest June 2022 after as a volunteer!",
      "answer3": "Ideas came to me very serendipitously. I was inspired by type and motion design artists. Based on the prompt 'connect' wanted to somehow showcase relationships between words based on relationships (me, you, us together). Wanted to generate entropy through animation to communicate feelings, emotion, and intensity.",
      "answer4": "Although I didn't use in this sketch, noise() is fun and also loadFont().",
      "answer5": "Figuring out how to rotate objects using trigonometry. Many past examples from other creative coders who were generous enough to share their code was extremely valuable. Still trying to figure out how to tone down the amount of entropy in this sketch.",
      "answer6": "ElliQ",
      "social": "https://www.instagram.com/joopark.io/",
      "id": "me-and-you-then-us",
      "picid": "me-and-you.jpg"
    },

    {
      "author": "Venus Ki",
      "pronouns": "she/her",
      "location": "Chicago, IL",
      "title": "portrait of an organic machine",
      "description": "I have a small business where I see handmade spiritual tools, home decor, up cycled apparel and more. I am currently a student majoring in math and computer science with a minor in Chinese. I am also a math tutor that currently specializes in Algebra , geometry, and trigonometry; however, I am planning to master higher levels in mathematics to teach to others. I am also studying numerology to understand the intuitive side of numbers, since that also bridges the concepts together. I am and will continue to be an artist, teacher, and student.",
      "alt": "This image displays a Goddess who sports royal gold jewelry. She wears bold stripes on her cheek to highlight her strength; however she drapes her hair and body in the finest silk scarves.",
      "live": "https://www.canva.com/design/DAFHKA7LFlI/yNrDQuxNxbo-FEt2JgF4cw/view?utm_content=DAFHKA7LFlI&utm_campaign=designshare&utm_medium=link&utm_source=viewer",
      "code": "https://editor.p5js.org/kfox20/sketches/1c6YyZMv0",
      "type": "Text",
      "tools": "",
      "difficulty": "Intermediate",
      "answer1": "I have a small business where I see handmade spiritual tools, home decor, up cycled apparel and more. I am currently a student majoring in math and computer science with a minor in Chinese. I am also a math tutor that currently specializes in Algebra , geometry, and trigonometry; however, I am planning to master higher levels in mathematics to teach to others. I am also studying numerology to understand the intuitive side of numbers, since that also bridges the concepts together. I am and will continue to be an artist, teacher, and student.",
      "answer2": "I was introduced to p5.js when I was struggling to find my major. I was studying math and computer science, but I was lacking the art in my life, so I found out my campus offered a creative coding class. With that course, I was introduced to Twine, and interactive story teller site, and P5.js. I knew that I would use P5.js more just for fun. I used the site for years and learned new functions.",
      "answer3": "With this project, this project just requires the P5.js library. We will mainly work with the shape and color functions in this library.",
      "answer4": "I just love the editor because I can create anything!",
      "answer5": "For this project, It can get a bit tedious with the measurements I have to calculate for more symmetrical works. It takes a lot of time to get the details. However, I use music to keep me in a state of flow to remain productive.",
      "answer6": "In general, check out numerology and the meaning of numbers. Numbers can create patterns, and this is important because with the editor feature, the canvas is like a grid.",
      "social": "Facebook - Venus Ki Portfolio- https://kalenafox808.wixsite.com/website Instagram - lyght_3r_flu1d",
      "id": "portrait-of-an-organic-machine",
      "picid": "organic-machine.png"
    },

    {
      "author": "Natalie Wu",
      "pronouns": "she/her",
      "location": "Hangzhou, China",
      "title": "SAKURA BLOSSOM",
      "description": "Because the course started in spring,so I was inspired by the blossoming cherry flowers----its janpanese name spelling is SAKURA.I want to realize its formation and capture the second when flower is blossoming.With its endless motion I hope people can feel the dynamic beauty,the power of the nature life,and the strength of natural circulation.",
      "alt": "GIF of dark pink blob-like flower expanding and shrinking over a light pink background.",
      "live": "https://editor.p5js.org/natalieyeye/sketches/ceBrnMFZr",
      "code": "https://editor.p5js.org/natalieyeye/sketches/ceBrnMFZr",
      "type": "Visual",
      "tools": "",
      "difficulty": "Intermediate",
      "answer1": "I'm a illstrator and student obsessed with coding and digital art and I was inspired by Lizzie Wilson (She's my tutor of the course in UAL and here's her page_https://lwlsn.github.io/). \n\nThis summer I participate the Cambridge AI programming and I met Pam Burnard,she aroused my interest in music and AI and we are lauching project now(sth like workshop):)",
      "answer2": "My tutor of the course in UAL, Lizzie Wilson,her art work is gorgeous and it really impressed me and aroused my motivation to learn!!",
      "answer3": "Simply by p5js coding.",
      "answer4": "map()",
      "answer5": "Sometimes you have to go to other website to find method to visualize and realize your ideas.",
      "social": "instagram: buzztequila",
      "id": "sakura-blossom",
      "picid": "sakura.gif"
    },

    {
      "author": "patternseeing",
      "pronouns": "he/him",
      "location": "Frankfurt am Main, Germany",
      "title": "W O V E",
      "description": "Heart shape created by using mathematical formulas and animating back and forth. So! cool to see. I'll eventually add more in this project.",
      "alt": "GIF of the WOVE app, displaying an abstract glyphs produced based on the user's input text forming (in order) the words 'Weave,' 'Hello World,' 'processing,' 'p5.js'.",
      "live": "https://wove.pages.dev/",
      "code": "https://github.com/patternseeing/WOVE-",
      "type": "Visual",
      "tools": "dist(), brightness(), changed()",
      "difficulty": "Beginner",
      "answer1": "Art and design research practitioner with exploratory interests in human experience and cognition.",
      "answer2": "I was using Processing previously and found P5js as a great means to build things that could easily be shared online. My first p5js sketches were a collection of interactive wallpapers created by tracking the movement of user's mouse position.",
      "answer3": "I Only used p5js in this project. There is a simple thresholding/image processing method implemented as part of creating the abstract glyphs.",
      "answer4": "lerp() is my favorite p5.js function",
      "answer5": "Yes. I had a trouble with the performance of my sketch since there were multiple operation kept within the draw function in the beginning. The p5.js function, changed() helped me to overcome this challenge.",
      "answer6": "https://youtu.be/AvUz_set4Rc",
      "social": "https://www.instagram.com/patternseeing/",
      "id": "w-o-v-e",
      "picid": "wove.gif"
    },

    {
      "author": "yongjoo yoo",
      "pronouns": "he/him",
      "location": "Seoul, Korea",
      "title": "BUBBLE WORDS",
      "description": "Words that disappear like bubbles. Control this new type of variable font by moving your mouse.",
      "alt": "In the center of the white screen, circles come together to form words. Words change every 2 seconds to 'sleep, science, dialogue, logic, table, island, heart' and it is expressed in Korean, English or symbols. As the cross-shaped cursor moves, the size of the bubble and the distance between the circles change.",
      "live": "https://editor.p5js.org/design.teo.ryu/full/I1PRivFtl",
      "code": "https://editor.p5js.org/design.teo.ryu/sketches/I1PRivFtl",
      "type": "Visual",
      "tools": "p5.sound, textToPoints()",
      "difficulty": "Intermediate",
      "answer1": "I majored in Visual Design at Seoul National University in Korea and now I am an interactive developer. Currently, I am developing a web service that anyone to create their own fonts.",
      "answer2": "https://www.youtube.com/c/TheCodingTrain",
      "answer3": "In p5, I used the textToPoints() function to convert the font vector to dots. And I got the desired visual effect by drawing bubbles on the points obtained.",
      "answer4": "random() is my favorite. Because randomness creates creative results that I didn't expect. Also, it is more convenient to use compared to Math.random() in vanilla script in that it can receive a specific number, array, etc.",
      "answer5": "It was difficult to use textToPoints(). This is because there were not many examples that were actually used and the explanations were not accurate. By making various examples and manipulating the parameters one by one, I was able to become familiar with the function.",
      "answer6": "Each letter has its own shape. It depends not only on what symbol the symbol (glyph) is, but also on what font design it has. However, humans have a meta-image in their head, and I wanted to express these thoughts through this work. I wanted to make a 'CONNECT' between our language and the shape of letters as words disappear and reappear.",
      "social": "https://www.instagram.com/contact_yj/",
      "id": "bubble-words",
      "picid": "bubble-words.gif"
    },

    {
      "author": "Munus Shih",
      "pronouns": "he/him",
      "location": "New York, USA",
      "title": "DT Soulmate Matcher: Weaving Community Data",
      "description": "Have you ever felt lonely because the world of design is such a diverse community but there is no one like you? Are you an aspiring artist, UIUX person, or creative technology enthusiast looking for a similar cohort? Or you may be someone who simply wants to get out of the bubble and make new friends? DT soulmate is an algorithmic-driven data visualization project that utilizes generative design and custom soul-matching to experiment with a new way of facilitating community building.",
      "alt": "Shows all the participant's card in a similarity matrix, which means that the participants who are more similar to each other will be visualized closer on the canvas. This image, however shows all the cards in a circular arrangement, and there are arrows in between them to point them to their soulmate.",
      "live": "https://munusshih.github.io/dt-soulmate/",
      "code": "https://github.com/munusshih/dt-soulmate",
      "type": "Visual",
      "tools": "",
      "difficulty": "Intermediate",
      "answer1": "I'm currently a rising second year graduate student of Design and Technology MFA in Parsons School of Design. This summer I'm both a processing foundation fellowship that organizes discussion around Critical, Intersectional and Anti-colonial creative tech education approach in Taiwanese Context, and an Design Engineer Intern at Design Systems International.",
      "answer2": "I was introduced to p5 by The Coding Train and the book 'Form + Code.' I formally learned it when I was taking a class from Xin Xin and Katherine Moriwaki in Parsons Design and Technology.",
      "answer3": "p5 was used to generate the unique weaved pattern for everyone. It was also used to visualize all the dataset and helped making it interactive.",
      "answer4": "My favorite function is textWidth(). It was hard to do any of that calculation in plain Javascript so it's really awesome of that function and how it contributes many typographic possibilities in p5.",
      "answer5": "It was hard to make some of the interactions intuitive because I'm not familiar with how the touchpad or mobile touching functions could be used to control p5. I'm not sure I've solved this problem but I will continue to work on it.",
      "answer6": "https://mechanic.design/",
      "social": "https://munusshih.com/",
      "id": "DT-soulmate-matcher",
      "picid": "soulmate-matcher.jpeg"
    },

    {
      "author": "Dxsbond",
      "pronouns": "he/they",
      "location": "Georgia, USA",
      "title": "Immersive World",
      "description": "As a musician, artist, and coder, I really love being able to merge all three of my creative mediums together to create art.",
      "alt": "Image of black lines, black spheres, and cubes made only from black outlines floating on a white background.",
      "live": "https://openprocessing.org/sketch/1285661",
      "code": "https://openprocessing.org/sketch/1285661",
      "type": "Visual",
      "tools": "p5.sound",
      "difficulty": "Intermediate",
      "answer1": "I am a Highschool Student at Holy Innocents Episcopal school and I am also a Rhythm Game Musician and I've made a couple of songs for upcoming games.",
      "answer2": "I started around 8th grade, when I saw a video of creative coding on youtube, and I decided to look further into it, as I hadn't really found any form of coding that caught my eye like it.",
      "answer3": "Everything coded in this is p5 related and the music was made separate by me and a friend named Aishii. I pretty much just created a system to create and remove cubes, spheres etc. as they float up endlessly. The middle was a combination of vertex related experiments I was messing around with to make a separate visualizer, I accidentally misplaced a variable and ended up with an interesting shape so I experimented further to find more.",
      "answer4": "My favorite p5.js feature is definitely push(), and pop() as I use it every other line in my projects now. I also love how p5 allows for such free addition of outside files for art and music and on top of that, libraries that can effectively help to manipulate them as well.",
      "answer5": "My mac laptop isn't very fast or good at handling 3D code or WEBGL code, so often I lag frequently and can't preview my project while making it as often as I'd like, but I've gotten used to it over time and I've learned to deal with it and visualize what I'm looking for in my head and figure out what I believe will accomplish that best before I preview.",
      "answer6": "I think you should check out my friend Aishii's soundcloud because she's an amazing musician as well!",
      "social": "https://soundcloud.com/disbandedbrkn https://instagram.com/dxsbond",
      "id": "immersive-world",
      "picid": "immersive-world.png"
    },

    {
      "author": "Biswayan Nandi",
      "pronouns": "he/his",
      "location": "Kolkata, India",
      "title": "Asteroids With Quadtreee",
      "description": "This project is based on Mr. Daniel Shiffman's coding challenge of asteroids and quadtree both. I have tried to add both of them for an efficient version of asteroids. Using quadtree, I am storing the points of the asteroids but those point have information about their parent asteroid i.e. to which asteroid they belong. This is the basic idea. From this I can query the quadtree about the points of a specific region and from those point I can get the asteroid. So in case of bullets I don't have to check for collisions to each and every asteroid on screen rather I can check for only the nearest ones. I have used the p5 touch gui library to create the gui buttons but sadly for touch screen its not yet ready 100%. It needs some polishing.",
      "alt": "Purple triangle with yellow, red, and turquoise circle trail on black background. Rounded gray squares and rectangles for the game's controls (pause, restart, exit, right, left, up, fullscreen).",
      "live": "https://biswayan375.github.io/Asteroids-With-Quadtree//",
      "code": "https://github.com/Biswayan375/Asteroids-With-Quadtree",
      "type": "Game",
      "tools": "p5.touchgui, p5.collide2d, p5.particle",
      "difficulty": "Beginner",
      "answer1": "I am a computer science graduate and currently I am willing to pursue the Masters of Computer Application (MCA) degree. Admissions are not done yet.",
      "answer2": "One of the favourite features of mine is be able to work with vectors both in two and three dimensions in the html canvas with p5. I mean this is awesome. We can actually implement interesting things with the help of these vectors instead of just drawing colorful squares and circles. But agin this is only one of my favourite features because this entire Library is my favourite one.",
      "answer3": "As for resources I have used Daniel Shiffman sir's youtube videos - \nAsteroids -> https://youtu.be/VFnF87-JNtY \nQuadtree -> https://youtu.be/z0YFFg_nBjw.\n\nI learnt from both the videos and combined their logic with some of my own addons like particle effect for thrust, asteroid sizes based upon screen size i.e. the size of the greatest rand asteroid is bigger on a computer screen than on a smartphone screen, touch controls(not yet fully polished). \n\nEarlier when I was building asteroids without using the quadtree I found it to be a little choppy while firing multiple bullets at once as it was using brute force method for collision detection. Then I learnt how to optimally detect collisions among points using quadtree data structure. Although at this time I was not sure how I am supposed to store an entire polygon of multiple points in the quadtree. So, I thought of the following idea - I can store the points of the polygons in the quadtree and those points will have information about to which asteroid/polygon they belong to. This thing also comes with a drawback, that is suppose if a polygon is entirely inside a region of the quadtree, then querying for that region will return some points for the same polygon, meaning I am checking for collision for the same polygon again and again which is not efficient at all. So, what I have done is I have created a set in which I am storing the polygons to which those nearby points I got by querying the quadtree belongs. Therefore in that set I have unique values/asteroids only without any duplicates. This is the main basic idea. I am not sure if I should store polygons inside a quadtree like this or not but this is the only idea came to my mind.",
      "answer4": "One of the favourite features of mine is be able to work with vectors both in two and three dimensions in the html canvas with p5. I mean this is awesome. We can actually implement interesting things with the help of these vectors instead of just drawing colorful squares and circles. But agin this is only one of my favourite features because this entire Library is my favourite one.",
      "answer5": "Yes there is one issue I faced with the p5 touch gui library and I am not fully able to overcome it. I was using bootstrap modals to provide some information about my project and I wanted to activate the modal by clicking on a button on canvas i.e. a p5 touch gui library button and that modal closes normally by clicking on a normal DOM button. This thing works 100% fine with a mouse. But when it comes to touch screen devices, any DOM button is unclickable the moment p5 touch gui library is initialised. I have cross checked this fact that if I invoke createGui() method of the p5 touch gui, any other DOM button is unclickable in touch screen. I don't kno why this is happening and I think to fix it I might have to use some other buttons library but for now, reloading the game works as a brute force way.",
      "social": "Facebook - https://www.facebook.com/biswayan.nandi.7, GitHub - https://github.com/Biswayan375",
      "id": "asteroids-with-quadtree",
      "picid": "asteroids.jpeg"
    },

    {
      "author": "Jess Pemberton",
      "pronouns": "she/her",
      "location": "Penryn, United Kingdom",
      "title": "we are trees",
      "description": "We are trees is an interactive and generative collage. Wonder, explore and collage a connected world. The generative pattern is governed by Fibonacci and populates the space to be a Forest of the Web (FOTW). Read the FOTW manifesto: https://forestoftheweb.net/forests-of-the-web ",
      "alt": "Interactive, generative collage with analogue source material. Collage of plants, facial features like hair and eyes, and houses.",
      "live": "https://forestoftheweb.net/forests-of-the-web/interactive-collage/",
      "code": "https://github.com/ForestOfTheWeb/we-are-trees",
      "type": "Visual",
      "tools": "copy()",
      "difficulty": "Beginner",
      "answer1": "I am a digital collage artist and was shortlisted for Hotel Generation with Arebyte Gallery this year. I am interested in the nature of and engagement on the internet. I am working on installation and video work this year. I am a visiting lecturer at Falmouth University and collaborate with musician Oh Mr James.",
      "answer2": "I was introduced to p5.js as a part of a variety of digital media techniques, while studying a masters in digital media. My first project was am experimental website using pieces of analogue collage rotating in a 3D environment with mouse interactivity that allowed you to interrupt the rotation and drag images around.",
      "answer3": "p5.js is the heart of this project. I used photoshop to cut out scanned in images, and p5 to create the experience.",
      "answer4": "My current favourite function is copy() as it allows the collages to collage themselves easily.",
      "answer5": "It was challenging to get the copy() function to paste in a Fibonacci sequence. I overcame this by watching tutorials by The Coding Train.",
      "answer6": "https://flowandecho.com/digital-botany/",
      "social": "https://www.jesspemberton.com",
      "id": "we-are-trees",
      "picid": "we-are-trees.png"
    },

    {
      "author": "Byeongchan",
      "pronouns": "he/him",
      "location": "Missouri, USA",
      "title": "Nuguri Math",
      "description": "Learn arithmetic with games",
      "alt": "When playing game, there would be some obstacles to avoid. Screenshot of Nuguri Math in play.",
      "live": "https://editor.p5js.org/bychan/full/loyq-8fKl",
      "code": "https://editor.p5js.org/bychan/sketches/loyq-8fKl",
      "type": "Game",
      "tools": "p5.sound, p5.collide2D",
      "difficulty": "Intermediate",
      "answer1": "I'm a computer science graduate student at WashU and I'm still learning about all about computer.",
      "answer2": "I watched Coding train Youtube video and I though it was fascinating.",
      "answer3": "When I'm making a game, I use p5.js library and it made me easy when I'm handling with graphics and collisions.",
      "answer4": "My favorite function is random(). Because there are many situations where randomization is needed when creating a game.",
      "answer5": "I mixed graphics and html in this project and after all, it was not a good idea because sometimes it was confusing when to use p5.js' function and native html. Moreover, p5.js doesn't support detailed functionality when it comes to html control(For example, I cannot put 'line break' between radio buttons)",
      "answer6": "Kids should solve some arithmetic questions to play a game and it surely increase their basic ability of arithmetic skills.",
      "social": "https://github.com/kbckbc/portfolio",
      "id": "nuguri-math",
      "picid": "nuguri-math.png"
    },

    {
      "author": "Mariana Leal",
      "pronouns": "she/her",
      "location": "São Paulo, Brazil",
      "title": "Phantom Calligraphy or some rest for those who see.",
      "description": "This work is made of hybrid calligraphy: half code, half human gestures, all connected. On a physical level, it doesn't require the calligrapher's presence to be executed. The gestures are recorded on a series of .txt files and can be played as long as the one running the code wishes it to be. \n\nThis work is generative art: there isn't a pre-determined order for the reproduction of the gestures. The program has a certain degree of autonomy to choose the gestures to be redrawn. And it never chooses all the gestures in one play. The composition can never be viewed all at once.",
      "alt": "Image of calligraphic traces that follow the style of the rect pen being drawn on the screen in the colors black, orange, yellow, pink, and green.",
      "live": "https://editor.p5js.org/lightestHand/sketches/th556JnFl",
      "code": "https://editor.p5js.org/lightestHand/sketches/th556JnFl",
      "type": "Visual",
      "tools": "",
      "difficulty": "Intermediate",
      "answer1": "I'm an artist who works mainly producing calligraphy with my hands and codes.",
      "answer2": "As far as I remember, my first project was a fork from a code called Chained Writing. I started with this code to change the visuals completely.",
      "answer3": "I used the online editor, because my computer doesn't support the javascript mode of processing, apparently. I had some difficulties with the loadstrings() function, that works in a completely different way from their processingJava version. My community of creative coders in Brasil helped me immensely in solving bugs.",
      "answer4": "My favorite feature is the online code editor, that allows me to code from any computer without having to install any other mode for processing.",
      "answer5": "To work with the loadStrings() function was a challenge because it doesn't work like the version in processing java mode. The callback part is still confusing to me.",
      "answer6": "the processing community day held in Brasil: https://pcd.encontrosdigitais.com.br/2021/",
      "social": "social media: instagram.com/lightesthand || portfolio: https://marileal.github.io/",
      "id": "phantom-calligraphy",
      "picid": "phantom-calligraphy.png"
    },

    {
      "author": "Laura Dowell Ballesta",
      "pronouns": "she/her",
      "location": "London, United Kingdom",
      "title": "Sine Fæ",
      "description": "Interactive visual art inspired by previous project made for Central Saint Martins.",
      "alt": "A square canvas is filled with small twinkling stars on a dark grey background. A helix shaped figure made out of pink hexagonal diamonds spins to music.",
      "live": "https://www.youtube.com/watch?v=dKEMoqiNeZQ",
      "code": "https://editor.p5js.org/laudowell/sketches/fJFb01oyB",
      "type": "Visual",
      "tools": "sin(), push(), pop(), sphere(), WEBGL",
      "difficulty": "Intermediate",
      "answer1": "I'm an Art and design foundation graduate from Central Saint Martins. I'm currently studying at the Creative Computing Institute at UAL and working teaching code to children.",
      "answer2": "At Uni.",
      "answer3": "P5js was great for this project because of how accessible the UI is to create visual code.",
      "answer4": "My favourite functions are push() and pop() because they allow you to be as creative as you like without having to spend too much time finding the right place to put your code.",
      "answer5": "It was my first project using sine waves, I think as long as you have patience and are  experimental you can make some cool looking stuff just by changing some values.",
      "answer6": "I'm not sure if this is cool, might be a bit embarrassing, but I like writing poems and making chaotic art https://www.instagram.com/scarlettchalice/?hl=es",
      "social": "https://www.instagram.com/lauradowell/?hl=es",
      "id": "sine",
      "picid": "sine.png"
    },

    {
      "author": "Debi Goldfisher",
      "pronouns": "she/her",
      "location": "New York City, USA",
      "title": "Connect Girls",
      "alt": "Program starting to populate screen with heads of girls with randomly generated hair and skin colors, in randomly generated locations, text appears that says 'Connect Every Girl to Coding'",
      "description": "My project represents my desire for all girls everywhere to be exposed to computer programming.",
      "live": "https://editor.p5js.org/Debi16/full/_Y2vIon2M",
      "code": "https://editor.p5js.org/Debi16/sketches/_Y2vIon2M",
      "type": "Visual",
      "tools": "random()",
      "difficulty": "Intermediate",
      "answer1": "I teach middle school science and computer science. I am a facilitator for Girls Who Code, and I am passionate about engaging underrepresented populations in the field of technology.",
      "answer2": "I joined a class offered by the NYC Department of Education for teachers, and was hooked because the graphic nature of the program helped with programming concepts. My first project was coding a traffic light that changed colors based on the position of the mouse. After this introduction, I have been independently challenging myself with more difficult projects.",
      "answer3": "I created this purely in p5.js because I had the idea in my mind and was able to test my code constantly and see the result visually. I used this page from Happy Coding to figure out how to write a function uniting shapes in a single design: https://happycoding.io/tutorials/p5js/creating-functions",
      "answer4": "I really enjoy being able to use the random function to change colors and locations.",
      "answer5": "My biggest challenge was creating a function of the whole face. I was able to create a single face, and had to figure out the syntax for the function, what parameters I needed to achieve the various colors of the hair and faces, as well as their positions. The hardest part was utilizing the random function within my function call, and having it work!  A second challenge I had was figuring out the relative positioning of each of the features to each other so I didn't need absolute values. I started with absolute values of a single face, and then slowly figured out how they related to the x and y of the original face ellipse.",
      "answer6": "To me the coolest thing is using code to bring creative ideas to life.",
      "social": "https://www.instagram.com/debi8446/",
      "id": "connect-girls",
      "picid": "connect-girls.png"
    },

    {
      "author": "Anneysha Sarkar",
      "pronouns": "she/her",
      "location": "Canberra, Australia",
      "title": "Turtle Monster",
      "description": "Turtle Monster is based on the Japanese folklore 'Urashima Taro'. It is a carrier that connects the human world and the Dragon Palace that is underwater.",
      "alt": "On a black background, there is a turtle with pink outer shell and olive green inner shell. Countless skin-coloured squares are attracted to a bluish-white shower of light from the sky.",
      "live": "https://editor.p5js.org/Anneysha7/full/feNfShb_U",
      "code": "https://editor.p5js.org/Anneysha7/sketches/feNfShb_U",
      "type": "Visual",
      "tools": "random(), push(), pop()",
      "difficulty": "Beginner",
      "answer1": "I'm a first-year Advanced Computing (Honours) student at the Australian National University.",
      "answer2": "I have been very interested in Creating Computing and Human Computer Interaction, and created this artwork as part of an Art and Interaction Computing course. However, I first learnt about p5.js during high school through CodingTrain. Back then, JavaScript was way too hard for me to pick p5.js up, so I never got around it until uni. It's quite an interesting coincidence that I am doing p5.js in my first year of uni and I am very grateful for it, since I had been wanted to do it for a very long time!",
      "answer3": "I used shapes to create all of my elements from scratch. I created my tortoise using a combination of circles, arcs and rectangles. Elements like the starry night, humans getting sucked into the white light and the white light (which I call Blessing) use random() in order to add randomness and variation to my artwork. In the process, I used the p5.js reference a lot.",
      "answer4": "Interaction functions like mouseX and mouseY because I can let my audience get involved with my artwork!",
      "answer5": "I was extremely puzzled about how to rotate shapes in p5.js because p5.js rotates a shape across the canvas axis and not the shape's axis. It took me a lot of reading through code tutorials to finally figure how to get rotation to work (Essentially, you use rotate() and translate()).",
      "answer6": "Cristina Tarqini's fantastic artwork: Medusae \nhttps://artsexperiments.withgoogle.com/medusae/",
      "social": "https://www.behance.net/anneyshas",
      "id": "turtle-monster",
      "picid": "monster.png"
    },

    {
      "author": "Josiah M",
      "pronouns": "he/him",
      "location": "Singapore, Singapore",
      "title": "Pattern Creater",
      "description": "This is a an example of how some simple code can be used to create wonderful patterns. This program uses a random number as the angle of rotation and, using a loop, creates wonderful patterns. (Colour is a HSL hue loop)",
      "alt": " An image of a colourful multi-pointed spiral that converges in the middle.",
      "live": "https://editor.p5js.org/ICantRemember/full/QqjpuLphA",
      "code": "https://editor.p5js.org/ICantRemember/sketches/QqjpuLphA",
      "type": "Visual",
      "tools": "mousePressed(), keyPressed(), random()",
      "difficulty": "Beginner",
      "answer1": "I am a secondary student in Raffles Institution and programme in my free time for fun.",
      "answer2": "I was introduced to a Khan Academy course on processing js. My first p5.js project was probably a sketch of a snow man (using line(), ellipse(), rect() and fill())",
      "answer3": "I used some simple trigonometry to calculate the x,y coordinates for the new point angle and distance. This is a very simple project which draws a line <length> long, rotates by <step>, then draws a new line <length - 1> long and repeates a 100 times producing amazing results.",
      "answer4": "One of my favourite functions is for(). Although being a simple loop available in many languages, the for loop is very versatile and can be used to make many wonderful things.",
      "answer5": "The biggest challenge that I faced was calculating the x,y coordinates given the angle and distance. As the drawing functions in p5.js only accept coordinates as perimeters, it took me a while to get the trigonometery right.",
      "answer6": "I feel that if inputted the correct numbers/formulas things on loop are really fun.",
      "id": "pattern-creater",
      "picid": "pattern-creater.png"
    },

    {
      "author": "Lawtro",
      "pronouns": "",
      "location": "Queensland, Australia",
      "title": "Blue Boy and Red Guy",
      "description": "Maneuver the 2 players to press the buttons and get to the exit. if one dies the over goes with it, thus they are connected.",
      "alt": "A game course level made of red and white line platforms with yellow and green blocks as obstacles. A blue circle with a smiley face is at the top right corner. A red square with a smiley face is at the middle right corner.",
      "live": "https://lawtro37.github.io/BB-RG/p5js_template-main/index.html",
      "code": "https://github.com/Lawtro37/BB-RG",
      "type": "Game",
      "tools": "p5.sound",
      "difficulty": "Intermediate",
      "answer1": "Coding a multiplayer game with p5 using fire base.",
      "answer2": "Coding course.",
      "answer3": "I coded the most of it with the p5.js library.",
      "answer4": "keyIsDown( ), I use this for everything.",
      "answer5": "A few errors, and bugs with the music.",
      "social": "https://lawtro37.github.io/LawtroWeb/LawtroWeb/index.html",
      "id": "blue-boy-and-red-guy",
      "picid": "blue-boy-red-guy.png"
    },

    {
      "author": "Rachel Ehrlich",
      "pronouns": "she/her",
      "location": "New York City, USA",
      "title": "Heart Flags",
      "description": "Make flags out hearts to communicate love and support! And because it's fun!",
      "alt": "Brightly colored overlapping hearts arranged to look like a Paxsexual pride flag. Hearts are sorted by color into approximate stripes. From top to bottom there are pink hearts, yellow hearts, and blue hearts.",
      "live": "https://r4chel.github.io/heart-flags/",
      "code": "https://github.com/R4chel/heart-flags",
      "type": "Visual",
      "tools": "dist(), random(), curveVertex()",
      "difficulty": "Advanced",
      "answer1": "I am a generative artist. I have a background in computer science and I am using that to make beautiful artwork.  My artwork is a celebration of bright colors and mathematics. I spend my days between playing making art and standing in Union Square where I talk to strangers about my art and teach people of all ages about Brownian motion and how math can be used to make beautiful art.",
      "answer2": "I started using p5.js as part of Genuary 2022. I had previously made art in rust and wanted to play with something else. I quickly got hooked on how playful p5 was and how playful I could be with it. I hit a rhythm where I was being inspired to make art and the process of creating and interacting with the art led to more inspiration to create more art. \n\nHere is the link to my very first p5 sketch in response to the genuary prompt: 'destroy a square' https://editor.p5js.org/R4chel/full/mFX7ms8Ms. \n\nAnd here is what it looked like after 3 hours of playing and exploring what I could in p5: https://editor.p5js.org/R4chel/sketches/1dkGIC84o. \n\nMy very first time playing with p5.js was the day before in the context of some pair programming at the recurse center and I was really inspired and decided to play by myself the next day. ",
      "answer3": "This project is fully implemented in p5.js. Here is the source for the formula I used for what I call in my code 'fancy hearts': https://pavpanchekha.com/blog/heart-polar-coordinates.html. \n\nSources for hex codes for pride hearts: https://www.kapwing.com/resources/official-pride-colors-2021-exact-color-codes-for-15-pride-flags/, https://www.flagcolorcodes.com/flags/pride. \n\nI used the genuary prompts as a way of growing as an artist and as inspiration for p5 projects. It worked really well together. Here is a collection of pieces I made for genuary, most of which were written in p5.js although some of the pieces were made my existing rust art tool: https://www.symbiocene.gallery/genuary2022-joy-of-randomness",
      "answer4": "I love the editor so much. I love how quickly you can ramp up. I warn people if they spend too much time around me they might accidentally end up writing some p5. I have had the absolute delight of getting so many people to open up the editor and create a circle. Set it's color and have it change size / color / position. I love empowering programmers who have never made generative art to make generative art! I've mostly worked with self described non-artist programmers, but also have had the delight of introducing a few kids to programming through the context of let's make something on the screen. \n\nI love how quickly I can ramp someone up. But also as some one who has been using it for a few months, I love how quickly I can prototype an idea and just have something do something. Related to the editor being my favorite thing I love the auto-refresh checkmark. \n\nI am now writing large p5 projects I want version controlled and to deploy myself so I don't use the editor nearly as much but that spirit of quick prototyping is still there.",
      "answer5": "The hardest part of this project was figuring out how to rotate the hearts! I defined the hearts in polar coordinates. There is a formula for the points of a heart in terms of radius and theta. If I rotated the shapes by adding a thetaOffset the hearts would overlap because they are not centered at their 'origin.' \n\nThe solution was to relearn some linear algebra! But in simpler terms, to define the circle in terms of a bounding circle and rotate about the center of that bounding circle not the 'origin' of the heart. I then had to figure out the mapping between center of bounding circle and origin of heart. That I did not do with fancy math. That I did empirically by setting values and drawing both the heart and the bounding circle and just trying different x-offsets and y-offsets until I found values that were close enough. \n\nUpdate: Nothing I said above wasn't true. Buuuttt after writing that answer yesterday and continuing to work on the project I ended up refactoring and simplifying how a lot of that was done. But the journey was still painful and part of the process, just not quite as reflected in the final code. The change I made was to just translate once at the end rather than translating before rotating and scaling. But understanding how all of it worked and why was key to the moment of realizing I could make it simpler.",
      "answer6": "https://rachel.joyofrandomness.com/art/rust-art/ <--- That is the reason I am an artist. It is generative art written in Rust + wasm. I created that with the goal of learning rust. And then I liked what I was making so much I started looking into how to get my artwork printed. Initially for myself and then to sell. Over a year and half later I am a full time generative artist! Also it's super fun!  It's open source. Here is the code https://github.com/R4chel/art",
      "social": "https://www.instagram.com/joyofrandomness/, rachel.joyofrandomness.com, joyofrandomness.com, https://twitter.com/joyofrandom",
      "id": "heart-flags",
      "picid": "heart-flags.png"
    },

    {
      "author": "Ilan Elovitz",
      "pronouns": "he/him",
      "location": "Pittsburgh, USA",
      "title": "Quilter",
      "description": "A tool to help with laying out repeating geometric quilt designs. It can be hard to visualize how a quilt block will look when it is repeated, so this tool makes playing around with that intuitive.",
      "alt": "A web application has a central display and a series of buttons around it. The display shows a repeating geometric pattern made up of triangles, squares, and diamonds in blue green and orange. The pattern forms a series of X's and overlapping shapes.",
      "live": "https://editor.p5js.org/ilovit/full/M7vOG2aoQ",
      "code": "https://editor.p5js.org/ilovit/sketches/M7vOG2aoQ",
      "type": "Code",
      "tools": "createGraphics(), pop(), push(), p5.Element",
      "difficulty": "Intermediate",
      "answer1": "I'm a senior in Art at CMU. I'm currently working on a large hand-printing book project, and I've enjoyed doing some coding in my spare time to let off some steam.",
      "answer2": "In creative coding class at CMU with Golan Levin.",
      "answer3": "I'm using p5.js for the core of the app, but there's lots of HTML, CSS stuff in the user interface. Basically, the current state of the quilt block get's printed to an offscreen buffer every frame, and then that buffer is printed onto the p5 canvas in a grid with transformations applied, any interactions with the quilt are changing the underlying quilt pattern stored in a js object.",
      "answer4": "graphics buffers and blend modes! Also pixels. I like doing cool things with graphics.",
      "answer5": "HTML can be tedious. In the end I just had to push through it to get back to the fun parts. Also lots and lots of googling.",
      "answer6": "My absolute favorite thing on the internet: https://www.reddit.com/r/pics/comments/ai8h3s/chairexe_has_stopped_working/. There are just so many layers to that post, and I feel like it sums up a generation.",
      "id": "quilter",
      "picid": "quilter.png"
    },

    {
      "author": "Yueqing",
      "pronouns": "she/her",
      "location": "Shanghai, China",
      "title": "Dive in Time",
      "description": "Dive in Time is an interactive project which turns Time into a Rive and allows the audience to start his/her/its own journey in Time.",
      "extradesc": "- Single click to start the BGM; - Press Any key to Dive in Time; - ↑ and ↓ to mive up and down; - A summery woule be generated and auto-downloaded at the end - It should be a 'txt' file named Dive in Time, - the file is SAFE. Enjoy your journey! and Cherish the moment.",
      "alt": "Time In a default mode. Each circle represents an individual. They meet and make connections with each other. Different colors show different characteristics.",
      "live": "https://editor.p5js.org/yd2512/full/HvVMNqKC1",
      "code": "https://editor.p5js.org/yd2512/sketches/HvVMNqKC1",
      "type": "Visual",
      "tools": "p5.sound",
      "difficulty": "Beginner",
      "answer1": "I'm a game designer with a focus on human-computer interaction. This summer, I became a graduate student at NYU IMA LOW RES.",
      "answer2": "My professor Carrie Wang at NYU introduced me to p5.js in her Creative Coding class. My first p5.js project was a self-portrait sketch.",
      "answer3": "I first made a non-interactive version of the TIme river with flashing circles in it. then I add a circle that can be controlled by the keyboards, then highlight it. Finally calculated some variables to generate the txt file.",
      "answer4": "map(), saves a lot of calculations.",
      "answer5": "Music doesn't start automatically in fullscreen mode :( Then I found it is impossible to make it happen since it is the browser's fault. So I just add a click function to let the BGM start after a single click.",
      "answer6": "Clouds in the sky",
      "social": "www.yueqingdai.com",
      "id": "dive-in-time",
      "picid": "dive-in-time.png"
    },

    {
      "author": "Benjamin Man",
      "pronouns": "he/him",
      "location": "Fremont, California",
      "title": "Personal Website",
      "description": "A personal website with several simple generative/interactive background animations.",
      "alt": "Blue text box in the center with the name 'Benjamin Man' and links to socials. In the background, a grid of cubes that follow the mouse. The cubes are outlines that fill with black when the mouse hovers over.",
      "live": "https://benjaminman.com/",
      "code": "https://github.com/benman604/benman604.github.io",
      "type": "Code",
      "tools": "WEBGL, map()",
      "difficulty": "Intermediate",
      "answer1": "I'm a high school senior looking to major in Computer Science.",
      "answer2": "A video by Daniel Shiffman I found when trying to learn sorting algorithms.",
      "answer3": "I used the p5js canvas as a background for my website, and added buttons to shift through various sketches.",
      "answer4": "WEBGL, 3d stuff can be really cool",
      "answer5": "Being able to dynamically load a p5js sketch. I was able to do this by reading a URL query parameter to load a sketch by setting the URL of the script tag to it, so that way p5js would be reloaded every time I load another sketch.",
      "answer6": "https://www.youtube.com/watch?v=LdDEhW-ROfU",
      "social": "https://benjaminman.com/",
      "id": "personal-website",
      "picid": "personal-website.gif"
    },

    {
      "author": "4Loop",
      "pronouns": "he/him",
      "location": "Mashhad, Iran",
      "title": "G Loop",
      "description": "Our universe looks pretty chaotic, I give you that. For me, cosmology has always been filled with topics that make me fascinated. With my major being physics, I learned that gravity, as one of the four fundamental forces of nature, is the most absorbing one, despite being the most undiscovered force in the world. In this visualization, I intend to emulate a simple system based on Newton’s law of universal gravity. I considered the first 3000 numbers of Recamán's sequence in Cartesian coordinates as gravitational points and released 210 free particles in seven separate groups with initial locations and different colors in space to move in the gravitational field resulting from my gravity particles. The outcome, which you can see, is the recording of the particle paths.",
      "alt": "A dark background and seven group of particles with different colors moving in the space and forming an image like a galaxy formed with different particles.",
      "live": "https://editor.p5js.org/saeidafc/full/_ZctC6P81",
      "code": "https://editor.p5js.org/saeidafc/sketches/_ZctC6P81",
      "type": "Educational",
      "tools": "p5.Vector",
      "difficulty": "Intermediate",
      "answer1": "Bachelor's of Science in Physics. I love coding since I was 10 years old. by learning p5.js I would like to bring some physics theories into making generative arts.",
      "answer2": "I was interested about Generative art and found out that one of the tools of creating these type of art is P5.js and then found the Coding train videos and started my journey.",
      "answer3": "I used the idea of attraction and repulsion force by Daniel Shiffman and asked myself why not mixing it with something to get a beautiful result so I used the Recamán's sequence as my attraction points and let the free particles move around these points and at the end by tuning different parameters I got this result.",
      "answer4": "noise()",
      "answer5": "Main challenge for me was the question that how should I tune the code and change the parameters to get kind of an artistic result. I guess I coded over 10 different ideas of choosing parameters to get an acceptable output.",
      "answer6": "I guess my another experience with visualizing the Collatz conjecture and the logical error I faced to and the final result would be cool too.",
      "social": "@4looop on Instagram and Twitter",
      "id": "g-loop",
      "picid": "g-loop.png"
    },

    {
      "author": "Ike Bischof",
      "pronouns": "he/him",
      "location": "Roseville, USA",
      "title": "Data In Colors",
      "description": "This sketch allows users to create images that have secret data hidden inside by changing the colors of the pixels. It turns file data into something you can actually see. What better way to connect art and computer science?",
      "alt": "Image of a picture of a playground inside a vinyl. Text saying 'The Sounds of Roseville' is on the top. Noise grain is over the entire image.",
      "live": "https://ikeb108.github.io/SOR-Explain-1/",
      "code": "https://github.com/IkeB108/Data-In-Colors-SOR-1",
      "type": "Visual",
      "tools": "loadPixels(), updatePixels(), createFileInput()",
      "difficulty": "Intermediate",
      "answer1": "I am a Communications major at Sac State University that does creative coding and YouTube videos in his spare time. I've spent my summer writing P5JS libraries that are designed to help create projects like this one.",
      "answer2": "I was introduced to P5JS through Daniel Schiffman's Purple Rain tutorial video. I learned nearly everything I know about P5JS from Coding Train.",
      "answer3": "The entire project is on a P5 canvas. P5's loadPixels() and updatePixels() functions were essential to making a program that can 'read' and 'write' secret data into an image.",
      "answer4": "My favorite feature is loadPixels()",
      "answer5": "I struggled to make the sketch behave the same on both mobile and PC. One fix was preventing zooming/panning on the webpage and centering the canvas in the webpage.",
      "answer6": "Some libraries and tutorials I have made for P5JS: https://ikebot108.weebly.com/tutorials--coding-libraries.html",
      "social": "https://ikebot108.weebly.com/",
      "id": "data-in-colors",
      "picid": "data-in-colors.png"
    },

    {
      "author": "Ella Inman",
      "pronouns": "she/her",
      "location": "Edmond, USA",
      "title": "The Heart of Music",
      "description": "Music is becoming a more relevant part of our lives and can connect us in special ways.",
      "alt": "Red heart on a turquoise background with 5 small instruments (guitar, violin, piano, microphone, electric guitar) floating around.",
      "live": "https://editor.p5js.org/Forehead/full/my-nqdlC0",
      "code": "https://docs.google.com/document/d/1TIhlFox5yxNho-dHM6vINH7Y9UD9w_kLLRHN3PB7KK8/edit?usp=sharing",
      "type": "Visual",
      "tools": "p5.animS, p5.shape.js",
      "difficulty": "Beginner",
      "answer1": "I'm really just trying to survive another year of school so I can do what I love.",
      "answer2": "A teacher introduced me and I went off on my own.",
      "answer3": "I used some past projects so I could get an idea of what of wanted to do with this. I also spent way too much time on perfecting the photos. I got close enough. Also, I apologize for the cheese.",
      "answer4": "I really like p5.button, but didn't have a use in this project. I like making interactive stuff.",
      "answer5": "Debugging was what got me the most. I was constantly asking myself “But why are we doing this?!”. My friends “enjoyed” my rants and I ended up stepping back for a day then coming back to it to find the problem was simple.",
      "answer6": "MIT App Inventor is a really cool place to check out. It deals in blocks and simplifies things. It is where I started.",
      "social": "",
      "id": "the-heart-of-music",
      "picid": "heart-of-music.png"
    },

    {
      "author": "Attilio Erriquez",
      "pronouns": "he/him",
      "location": "Bologna, Italy",
      "title": "TicTacToe: learning example",
      "description": "This example show capability of p5js to realize a simple game, it is part of a training I am preparing to allow kids or newbies to learn coding.",
      "alt": "Two green X's and three red O's in a tic-tac-toe game. The grid is made of the white lines over a dark gray background.",
      "live": "https://editor.p5js.org/attilioerriquez/full/wkTREEk-3",
      "code": "https://editor.p5js.org/attilioerriquez/sketches/wkTREEk-3",
      "type": "Game",
      "tools": "frameCount(), int()",
      "difficulty": "Intermediate",
      "answer1": "I am employed in a Railway industry but in spare time I am interested in computer languages and similar topics. I am currently preparing a training for coding and I found p5js a very good way to introduce coding with javascript adding a visual output and interaction in easy way!",
      "answer2": "I have seen an example from YouTube TheCodingTrain channel and I immediately started building on my own, having large experience in software enginnering and already working with javascript.",
      "answer3": "I am using coding examples in my training, TicTacToe version1 is about to explain how to show which move the algorithms is elaborating without use of busy waiting. I have not used special resources than p5js reference, as I have large experience in software writing",
      "answer4": "I have not yet used many libraries of p5js, so my favorite feature is the online editor which allows everyone to learn p5js without installing anything!",
      "answer5": "Since online editor has not a breakpoint / step debug feature, the main difficulty has been to tune the project, but the console.log can support bugfix! I wish to move soon on p5 library in react to overcome this limit.",
      "social": "https://www.linkedin.com/in/attilio-erriquez-a7b7212/",
      "id": "tictactoe-learning-example",
      "picid": "ttt.png"
    },

    {
      "author": "locqhuynh",
      "pronouns": "he/him",
      "location": "Ho Chi Minh City, Vietnam",
      "title": "Grey Wolf Optimizer simulation",
      "description": "Simulate the motion of GWO particles through iterations to search for x and y values to minimize the z value of the Rastrigin function.",
      "alt": "GIF of white particles with translucent white trails growing closer together on top of a dark gray background.",
      "live": "https://editor.p5js.org/quanglochuynh/full/4bYAWYU_p",
      "code": "https://editor.p5js.org/quanglochuynh/sketches/4bYAWYU_p",
      "type": "Educational",
      "tools": "",
      "difficulty": "Advanced",
      "answer1": "I am an Industrial Engineering student in Vietnam.",
      "answer2": "Mr. Daniel Shiffman - The coding train Youtube channel. First project with p5: Pose recognization with PoseNet.",
      "answer3": "I have already program the GWO and other metaheuristic-based optimization algorithm by Matlab, however it was very fuzzy to see the actual action of each algorithm. Therefore I programmed GWO and PSO using p5 to verify the differences. The result was very clear, PSO particle converged faster but more likely to the local minimum solutions. GWO in the other hand, converged slower but give more correct (global minimum) answers.",
      "answer4": "The adjustable framerate setting.",
      "answer5": "I had tried using p5 Vector, however there are some error that the Vector operation was not correct, thus I used mathjs matrix instead.",
      "answer6": "You guy should check out my PSO simulation here: https://editor.p5js.org/quanglochuynh/sketches/tXp5Y5-8O and the continuous version of GWO by changing the sketch.js file to sketch2.js",
      "social": "https://www.researchgate.net/profile/Loc-Huynh-14, https://www.facebook.com/locqhuynh",
      "id": "grey-wolf-optimizer-simulation",
      "picid": "grey-wolf.gif"
    },

    {
      "author": "STEMcoding Project",
      "pronouns": "he/him",
      "location": "Columbus, Ohio",
      "title": "Project Mercury",
      "description": "Popular culture celebrates Katherine Johnson who was a black mathematician who worked for NASA, as depicted in the movie Hidden Figures, but students often never get to see some of the calculations she did. In this STEMcoding activity we explore some of the mathematics she would have worked on to understand how John Glenn's Mercury capsule would behave in orbit. Activity designed by Chris Orban. Video features Jahmour Givans.",
      "alt": "Visualization of how the Mercury capsule reentered Earth on top of a white background.",
      "live": "https://youtube.com/playlist?list=PLISRe8GegO8S-188B7veZ6dYLSqZoXFkG",
      "code": "https://editor.p5js.org/ChrisOrban/sketches/pQt5nIvDa",
      "type": "Camera",
      "tools": "mousePressed(), mouseX, mouseY",
      "difficulty": "Intermediate",
      "answer1": "I am a professor in the physics department at Ohio State University and this summer I am training math teachers in Ohio how to use p5.js in their classrooms in a way that aligns with math standards!",
      "answer2": "I started with processing in 2014 based on the recommendation of a colleague. Later I switched to p5.js to avoid having students install the IDE and because I was excited about editor.p5js.org",
      "answer3": "I tend to create my own wrapper functions around p5.js commands. This helps me simplify the progrsms so science and math teachers can focus on the science and math.",
      "answer4": "Being able to launch the object using a touch screen is definitely my favorite feature that I use in this activity.",
      "answer5": "Sometimes it takes a minute for the image of the Earth to load. I had some headaches trying to figure out if I did something wrong.",
      "answer6": "Here is a link to part 2 of Project Mercury where you can include air drag and predict where the Mercury capsule will land, just like Katherine Johnson did! https://www.asc.ohio-state.edu/orban.14/stemcoding/mercury2/mercury2.html",
      "social": "http://YouTube.com/STEMcoding",
      "id": "project-mercury",
      "picid": "project-mercury.png"
    },

    {
      "author": "Eutuxis",
      "pronouns": "they/them",
      "location": "Chania, Greece",
      "title": "grasshopper to human",
      "alt": "Green and blue lines on a black background in the shape of a grasshopper transforming into a human.",
      "description": "An abstract illustration of a man who turns to grasshopper and vice versa with mouse maping.I wanted to represent the intrinsic connection man has to nature.",
      "live": "https://editor.p5js.org/papadosifouele/full/TXdncUN2f",
      "code": "https://editor.p5js.org/papadosifouele/sketches/TXdncUN2f",
      "type": "Visual",
      "tools": "map()",
      "difficulty": "Intermediate",
      "answer1": "5th year of architecture university.",
      "answer2": "A lab in our university (Tie lab of crete)",
      "answer3": "i had designed the components in procreate and then p5 was used to add movement",
      "answer4": "map!",
      "answer6": "reddit groups with generative art",
      "social": "www.artstation.com/eutuxis",
      "id": "grasshopper-to-human",
      "picid": "grasshopper.png"
    },

    {
      "author": "Martin Kopta",
      "pronouns": "he/him",
      "location": "Prague, Czech Republic",
      "title": "footnote 23",
      "description": "Excerpt from Human Manual.",
      "alt": "An example of a perfect connection. White rectangles on top of a black background with the word 'perfect' underneath.",
      "live": "https://martin.kopta.eu/footnote23/",
      "code": "https://gitlab.com/mkopta/footnote23",
      "type": "Text",
      "tools": "rect(), random(), deltaTime, p5.play",
      "difficulty": "Beginner",
      "answer1": "I am a professional programmer building backend services and amateur photographer.",
      "answer2": "I watched 'How Do You Steer a Drill Below The Earth?' on Practical Engineering Youtube channel about directional drilling and Coding Train was mentioned there. So I watched the Coding Challenge 172: Horizontal Directional Drilling and learned about p5js. I went to the site p5js.org and I was very excited with what I learned and especially with the showcases. I decided I want to try it too.",
      "answer3": "My goal was to express that it is normal to have imperfect connection with other people and things get better if you stay in touch. I was basically trying to convince myself to not be scared of the first impressions and encourage myself to not run away. The p5.js helped me to convey my subconscious understanding of my actions even before I was able to formulate it in words.",
      "answer5": "I was avoiding use of deltaTime for a while, because I could grasp how it is supposed to be used, as most of the explainations I've found bound it together with frameRate(), making it harder to understand the basic idea. Also, this was my first time prioritizing accesibility and I tried to built-in accessibility into the creation as a part of it, not as an extra feature. Not sure if I did right, because I am not sure how to test for accessibility.",
      "answer6": "The p5js showcases. But it's hard to reach the previous years. Could you please make it easy to browse all showcases from all the years?",
      "social": "https://martin.kopta.eu",
      "id": "footnote-23",
      "picid": "footnote23.png"
    },

    {
      "author": "Ünver Çiftçi",
      "pronouns": "he/him",
      "location": "Tekirdağ, Turkey",
      "title": "High School Mathematics Animated",
      "description": "I believe that a high school student can illustrate every topic in high school mathematics. Due to minimalist design of p5.js, it is possible for high schoolers to compute, animate and simulate. Most of the time they are not using manipulatives in mathematics education. But programming is experiencing, so that they can grasp the subject. They will also start lerning first principles of engineering by programming their scenerios. The work is still in early stage. There are eight videos in Turkish. If there will be demand it would be nice to create more materials in several languages.",
      "alt": "GIF of a speed problem. Two dark gray rectangles approaching each other on top of a pink background.",
      "live": "https://youtube.com/playlist?list=PLU8l6n1Iz_GFRey6DKQNsd7iDSr27qlfR",
      "code": "https://editor.p5js.org/Matematik/sketches/uyS1VBBik",
      "type": "Text",
      "tools": "",
      "difficulty": "Beginner",
      "answer1": "I am an appied maths professor in Tekirdağ Namik Kemal University. I used to be a be a middle school mathematics teacher and like teaching a lot.",
      "answer2": "By the Coding Train. It is inpiring! My first project is the present one actually.",
      "answer3": "I programmed mathematical consepts and tried to encourage people that it is possible and useful. My first example is a speed problem where two vehicles move towards each other with varying speeds, and simulated their arrivals. In onether example, I coded finding squareroots using rectangles. The other one is on finding limits. There are other on triangles, multiplication, work problems, graphics of functions and computing Pi.",
      "social": "https://www.linkedin.com/in/unverciftci",
      "id": "high-school-math-animated",
      "picid": "hs-math.gif"
    },

    {
      "author": "Arkimedz",
      "pronouns": "he/him",
      "location": "Toronto, Canada",
      "title": "Starmap Generator",
      "description": "Vintage star system generator.",
      "alt": "A vintage star system map generator that generates a new map each time the user clicks on the generator.",
      "live": "https://arkimedz.itch.io/starmap",
      "code": "https://arkimedz.itch.io/starmap",
      "type": "Visual",
      "tools": "createGraphics()",
      "difficulty": "Advanced",
      "answer1": "I've been in the software engineering industry for 10+ years but always had an inclination towards visual art.",
      "answer2": "Card game.",
      "answer3": "There's no animation in this generator, so it's a single frame. But given the complexity in the elements, had to use several optimization techniques like using off-screen buffers, etc.",
      "answer4": "Filters",
      "answer5": "I wanted the text justification but that didn't exist natively in P5.js so had to write my custom text justification functions which took a bit of time.",
      "answer6": "https://watabou.itch.io/",
      "social": "https://twitter.com/arkimedz",
      "id": "starmap-generator",
      "picid": "star-system.png"
    },

    {
      "author": "Gaz",
      "pronouns": "he/him",
      "location": "Bariloche, Argentina",
      "title": "Trazos Club",
      "description": "Trazos.club is a web platform for collective drawing. Through collaborative practice and the animated drawing, Trazos looks to foster new artistic, recreative and educational experiences for everyone and anyone, incorporating expressive languages into the everyday. \n\nTrazos.club is a free software project. The platform responds to the need to generate a technological solution that uses collaborative systems in real time, applying the new standards for web 2.0.",
      "alt": "Image of two people using Trazos Club on their laptops and projected onto the wall in front of them. They are drawing neon colored line and swirls.",
      "live": "http://trazos.club/",
      "code": "https://github.com/andiamo/fideos",
      "type": "Drawing Focused",
      "tools": "",
      "difficulty": "Intermediate",
      "answer1": "I'm a creative dev and agile manager based in Argentina. Currently Product Manager at my own startup, Grow with Jane.",
      "answer2": "I discovered p5 through Processing! These tools gave me a way to express myself artistically through the language I've chosen my whole life, programming :) \n\nOne of my first dives into this world was through The Nature of Code, being from Argentina I had to internationally order the book and it's still one of my most cherished books",
      "answer3": "Trazos has been in the works for many many years and it was first created by Processing collaborator Andres Colubri and plastic artist Marcela Rapallo. P5 is embedded at the heart of it, being the motor for the canvas, I would say the second most important piece of tech is sockets.io which we use for communication of the lines and the chat. Users can also generate GIFs from the drawings they create and upload to Giphy.",
      "answer4": "My favorite p5 feature is accessibility! As a trained developer I've worked along many artists with less experience in coding and p5 is just a breeze for them to get jump started into drawing things.",
      "answer5": "Community is always the best and most challenging aspect of big and open source projects like Trazos. We're always looking for new devs that want to join the adventure and do some coding :)",
      "answer6": "Check one of our gatherings! https://www.youtube.com/watch?v=x8kYC3bnp0E",
      "social": "https://gastonlozano.com, https://www.instagram.com/gaz.town",
      "id": "trazos-club",
      "picid": "trazos.jpeg"
    },

    {
      "author": "Waffle",
      "pronouns": "he/him",
      "location": "Dukhan, Qatar",
      "title": "Clock",
      "description": "A Simple Clock that tell the time via a virtual clock, it displays the time wit ha digital format and also tells the date and can speak the time when a button is pressed",
      "alt": "A date, analog format time, a clock, a buttom with the word 'Time' on it",
      "live": "https://editor.p5js.org/suhaasmavuri4679/full/sFSPbnjkR",
      "code": "https://editor.p5js.org/suhaasmavuri4679/sketches/sFSPbnjkR",
      "type": "Visual",
      "tools": "p5.speech",
      "difficulty": "Beginner",
      "answer1": "I am a high schooler who is aiming to go into the Computer Science field in the future.",
      "answer2": "I first learned about it in a CampK12 class. My First Project was a 'chase the ball' game",
      "answer3": "I used the library to assist me in my project.",
      "answer4": "My favourite feature on p5.js is the p5.speech.js because you can use it to do many audio related things.",
      "answer6": "I faced problems like not knowing how to solve certain issues so i watched videos and scrolled through the website to find out how to solve them and also did a lot of trial and error.",
      "social": "https://www.youtube.com/channel/UCcPr222K0GE-nVbFmUcvn0A",
      "id": "clock",
      "picid": "clock.png"
    },

    {
      "author": "David C. Petty",
      "pronouns": "he/him",
      "location": "Brookline, USA",
      "title": "centered-green",
      "description": "After Richard Anuszkiewicz Centered Green at the Santa Barbara Museum of Art.",
      "alt": "p5 sketch in the center of white webpage containing a green square in the center of black and brown lines. Text at the top of the page reads 'after Richard Anuszkiewicz Centered Green.' There are sliders at the bottom for number of lines and percentage.",
      "live": "https://psb-david-petty.github.io/p5js/centered-green/",
      "code": "https://editor.p5js.org/psb_david_petty/sketches/wsq-vu6Po",
      "type": "Visual",
      "tools": "",
      "difficulty": "Intermediate",
      "answer1": "No libraries. I used the select() function to set the webpage style. I used draw functions to draw the image.",
      "answer2": "I teach computing and robotics at Brookline (MA) High School.",
      "answer3": "Hacking around with p5.js after visiting an art museum (Mass MoCA).",
      "answer4": "Ease of drawing in JavaScript.",
      "answer5": "Using mathematics to correctly line up the lines with the proper stroke width.",
      "answer6": "Coding Train.",
      "social": "https://github.com/psb-david-petty",
      "id": "centered-green",
      "picid": "centered-green.png"
    }
  ]
}
